{
  "14": [
    {
      "by": "14",
      "id": 30882919,
      "parent": 30878755,
      "text": "lol that&#x27;s a cool story you probably damaged the rings and cylinder wall by force starting it without taking some precautions first. If you have an engine that has sat a long time you definitely should pull the spark plugs and spay lubricant down the holes. Let it sit overnight. Then gently try and turn over the engine by hand and see if the rings are free or not. Something sitting so long the ring tend to stick to cylinder wall and turning over the engine suddenly can cause them to damage the cylinder wall and damage the rings. So while running down the hill you probably did some damage but it was moving fast enough that it could get enough compression to run while you had it running. After you stopped it and attempted to start it again there would be less oil on the pistons as well as any damage greatly reducing compression and preventing it from starting.",
      "time": 1648844686,
      "type": "comment"
    }
  ],
  "garrepi": [
    {
      "by": "garrepi",
      "descendants": 388,
      "id": 30878489,
      "score": 1324,
      "time": "2022-04-01 11:40:16",
      "title": "A few things to know before stealing my 914",
      "type": "story",
      "url": "https://www.hagerty.com/media/advice/a-few-things-to-know-before-you-steal-my-914/",
      "parent": null
    }
  ],
  "blastro": [
    {
      "by": "blastro",
      "id": 30878755,
      "parent": 30878489,
      "text": "In high school, my friends and I managed to resuscitate a 914 that had been stowed away in a garage for over a decade. We towed it to the top of a hill with a pickup truck and attempted a clutch start after we&#x27;d picked up some speed. None of us (especially me in the driver&#x27;s seat) expected this to work, but amazingly it fired right up. One of my friends managed to jog alongside and jump into the car as I tried to keep it puttering along, and we ripped a few laps around the neighborhood. Soonafter, we stopped the engine and were never able to get it started again. Thanks for bringing up this memory. Cool article.",
      "time": 1648825313,
      "type": "comment"
    },
    {
      "by": "blastro",
      "id": 30885134,
      "parent": 30882919,
      "text": "Thanks for this explanation. Totally makes sense!",
      "time": 1648863502,
      "type": "comment"
    }
  ],
  "gkoberger": [
    {
      "by": "gkoberger",
      "id": 30879102,
      "parent": 30878489,
      "text": "This is one of my favorite styles of writing. I have absolutely no clue what this person is talking about and have no interest in cars, yet I read every single word.<p>I love when people have such a deep knowledge of something that they can write an essay as unique and thoughtful as this. It reminds me of Kitchen Confidential, Surely You&#x27;re Joking Mr Feynman!, or any rant about British politics by David Mitchell.",
      "time": 1648826687,
      "type": "comment"
    },
    {
      "by": "gkoberger",
      "id": 30879333,
      "parent": 30879226,
      "text": "In this context (a fun blog post), I disagree. I find it to be incredibly clear when someone is playing in a world they truly understand and love.<p>Not to say one can&#x27;t be hoodwinked from time to time, naturally, but for me it&#x27;s not the &quot;facts&quot; that ring true. It&#x27;s the joy and humor and love that is hard to fake.",
      "time": 1648827612,
      "type": "comment"
    }
  ],
  "cameronh90": [
    {
      "by": "cameronh90",
      "id": 30879336,
      "parent": 30878489,
      "text": "This story reminded me of the time I was trying to exploit a web app as part of a bounty programme.<p>Unfortunately the application was so unstable that any attempts to SQLI, or really send any kind of malformed request would simply crash the entire site for hours, presumably until an admin came and restarted the server. DoS wasn&#x27;t included in the programme so I never won a bounty. I&#x27;m sure it could have been exploited, but it was simply so rickety and shoddy that I couldn&#x27;t figure out how.<p>Security through instability?",
      "time": 1648827620,
      "type": "comment"
    },
    {
      "by": "cameronh90",
      "id": 30879355,
      "parent": 30878907,
      "text": " &gt;  island with a 40mph speed limit<p>Does it begin with J and end with Y? (I&#x27;m a London-based bean!)",
      "time": 1648827707,
      "type": "comment"
    }
  ],
  "everybodyknows": [
    {
      "by": "everybodyknows",
      "id": 30881375,
      "parent": 30878489,
      "text": "&gt; The dual Webers don’t have chokes and you’ll be squirting fuel down the barrels with the accelerator pumps for the necessary priming regime.<p>The engineering Puritan will want to know that the Webers are a retrofit, a hack for escape from the factory&#x27;s refractory -- but cutting edge tech in the 70s! -- VW electronic fuel injection.  The EFI &quot;brain&quot; was a box the size of a small modern laptop, stuffed with individual transistors, inductors, capacitors and resistors.<p>No one in North America, it seemed, had any idea how to diagnose an internal fault.  The owner&#x27;s options were to buy a secondhand brain taken from a junked car, presumably there for some other reason, or the Webers.  Junkyard brains were refundable, but the several hours installing, testing, and possibly uninstalling were not, so careful deliberation was in order.<p>Access to the brain, like most engine compartment work on the 914, demanded the sort of agility, strength, and determination required of large-animal veterinarians, with access for most tasks from underneath, wedged as it was in a sort of triangular gap below and behind the seats and ahead of the rear trunk and transmission.",
      "time": 1648836464,
      "type": "comment"
    },
    {
      "by": "everybodyknows",
      "id": 30881644,
      "parent": 30878953,
      "text": "The name &quot;Neverland&quot; is new to me, but I remember that place of limbo well.  Assuming the tranny is in good order, there&#x27;s a firm spring detent that generally saves the driver from 1-&gt;R upshift failures.<p>The 1-&gt;4 mistake OTOH, having drifted a little too far right in Neverland, was easily fallen into, and the shuddering deceleration that follows may have been the cause of a few rear-end collisions over the years.",
      "time": 1648837632,
      "type": "comment"
    },
    {
      "by": "everybodyknows",
      "id": 30880850,
      "parent": 30878751,
      "text": "On mine, the well-corroded cast-pot-metal door handle snapped in two.  No problem: The ignition key could be wedged between the remaining stub of a handle and the frame, producing just enough leverage to pop the door catch.",
      "time": 1648834240,
      "type": "comment"
    },
    {
      "by": "everybodyknows",
      "id": 30883243,
      "parent": 30882222,
      "text": "&gt; high pressure fuel lines degraded and cracked<p>A vulnerability shared with all K-Jetronic engines.  At some point I got clued in and kept a fire extinguisher on board my own 914, just in case.  And it saw use, not on my own car, but doing damage control on a stranger&#x27;s VW Beetle, in flames on the freeway shoulder.",
      "time": 1648846687,
      "type": "comment"
    }
  ],
  "quadrifoliate": [
    {
      "by": "quadrifoliate",
      "id": 30878953,
      "parent": 30878489,
      "text": "&gt; Depress the clutch as you would in any car, and pull the knob from its secure location out of first gear. Now you will become adrift in the zone known to early Porsche owners as “Neverland” and your quest will be to find second gear. Prepare yourself for a ten-second-or-so adventure. Do not go straight forward with the shift knob, as you will only find Reverse waiting there to mock you with a shriek of high-speed gear teeth machining themselves into round cylinders.<p>I was confused by this until I searched for &quot;Porsche 914 shift pattern&quot; on Google Images. I guess it&#x27;s a dog-leg gearbox (<a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Dog-leg_gearbox\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Dog-leg_gearbox</a>).",
      "time": 1648826005,
      "type": "comment"
    }
  ],
  "schmichael": [
    {
      "by": "schmichael",
      "id": 30882450,
      "parent": 30878489,
      "text": "&gt; Do not become emboldened by your progress<p>I am eagerly awaiting the opportunity to stick this into docs or a tutorial someday. What a brilliant line that really captures that thrill of a newcomer to a problem feeling like they&#x27;ve accomplished something only to find the worst is yet to come.",
      "time": 1648842110,
      "type": "comment"
    }
  ],
  "ehnto": [
    {
      "by": "ehnto",
      "id": 30879068,
      "parent": 30878489,
      "text": "Speaking of security through obscurity, my car is a 96 Nissan and it&#x27;s had a few attempts on it. It&#x27;s easy enough to steal, but it&#x27;s getting hard enough for me to find replacement parts that I&#x27;d be surprised if thieves have everything, so I take some bits of the car with me if it&#x27;s sitting for a while.<p>I have a quick release wheel to deter the average opportunist from breaking my glass and ignition barrel, and with some wiring trickery and the bits I remove it&#x27;s never going to start. It&#x27;s aftermarket enough that stock parts won&#x27;t help the thief, so unless they have a laptop, an aftermarket ECU, and a tuner handy, they probably won&#x27;t get far.<p>Sucks to have to bother with all that, but alarms have never helped me, and you just can&#x27;t fix woeful 90s physical security.<p>One attempt on my car was only foiled because when I park up at my girlfriends house, I remove some 90s era fuses you can&#x27;t get anymore and take the box covers with me. A paperclip would work, but you&#x27;ve got to figure out that the specific fuses are missing first.<p>It&#x27;s not about being perfect when it comes to car security, it&#x27;s about being too much of a pain in the ass, so they&#x27;ll give up and move on. Just like bicycle security.",
      "time": 1648826527,
      "type": "comment"
    },
    {
      "by": "ehnto",
      "id": 30878884,
      "parent": 30878729,
      "text": "A friend of mine tweaked a sensor on his car and it wouldn&#x27;t recalibrate, which disabled all of the electronic assists. It drives like a shopping cart now.",
      "time": 1648825737,
      "type": "comment"
    },
    {
      "by": "ehnto",
      "id": 30879020,
      "parent": 30878727,
      "text": "There&#x27;s a sweet spot, around the 90s, where the cars are still running fine, and are not yet too complex to steal with a pocket knife.",
      "time": 1648826291,
      "type": "comment"
    }
  ],
  "mellavora": [
    {
      "by": "mellavora",
      "id": 30878751,
      "parent": 30878489,
      "text": "My first car was a 914. Love and miss it to this day.<p>At some point the solenoid died (or some other electrical component). So to start it, you&#x27;d have to reach under the car with a screwdriver (or some other piece of metal, but I kept a screwdriver in the car for this purpose), and short out across two terminals.<p>You then had 10-20 seconds to get out from under the car, into the driver&#x27;s seat, and turn the key. As a practiced manouver, it was pretty quick.",
      "time": 1648825280,
      "type": "comment"
    }
  ],
  "legitster": [
    {
      "by": "legitster",
      "id": 30880473,
      "parent": 30878489,
      "text": "&gt; Norman Garrett was the Concept Engineer for the original Miata back in his days at Mazda’s Southern California Design Studio.<p>hahaha. This whole time I was thinking &quot;I know the car is lovely, but this is why people love Miatas&quot;",
      "time": 1648832373,
      "type": "comment"
    },
    {
      "by": "legitster",
      "id": 30880771,
      "parent": 30880562,
      "text": "It really goes to show what makes the Miata so good. Even through this satire, you could tell this guy really loves his 914.",
      "time": 1648833836,
      "type": "comment"
    }
  ],
  "ghostpepper": [
    {
      "by": "ghostpepper",
      "id": 30878967,
      "parent": 30878489,
      "text": "This writing is brilliant<p>edit: just got to the author’s blurb at the bottom. He was an engineer on the original Miata, so it’s no surprise that he knows what he’s talking about.",
      "time": 1648826070,
      "type": "comment"
    }
  ],
  "BayAreaEscapee": [
    {
      "by": "BayAreaEscapee",
      "id": 30878742,
      "parent": 30878489,
      "text": "For awhile I was into autocross.<p>I remember one guy who would always show up in a Porsche 914 with racing tires, and he would run circles around us amateurs.",
      "time": 1648825231,
      "type": "comment"
    }
  ],
  "sbisson": [
    {
      "by": "sbisson",
      "id": 30878907,
      "parent": 30878489,
      "text": "Reminds me of my first car, a Mini Clubman estate with the fake woody panels on the side. The only thing you needed to know was that it had been re-engined with a hill-climb tuned Cooper S engine. Great on an island with a 40mph speed limit and too many rich folk with Ferraris and the like, as it could out accelerate them anywhere on the island. Sure it wouldn&#x27;t go faster than 50, but that was fine as it got to that speed almost instantaneously.",
      "time": 1648825834,
      "type": "comment"
    }
  ],
  "nes350": [
    {
      "by": "nes350",
      "id": 30878807,
      "parent": 30878489,
      "text": "<a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220401144722&#x2F;https:&#x2F;&#x2F;www.hagerty.com&#x2F;media&#x2F;advice&#x2F;a-few-things-to-know-before-you-steal-my-914&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220401144722&#x2F;https:&#x2F;&#x2F;www.hager...</a>",
      "time": 1648825448,
      "type": "comment"
    }
  ],
  "rob74": [
    {
      "by": "rob74",
      "id": 30879808,
      "parent": 30878489,
      "text": "Great article! Makes me wonder if in 40 years people will write about how to (not) get an old Tesla Roadster or BMW i3 going again? Although, rather than pumping the acceleration 4 times to get enough gas into the engine so it will start, that will probably begin with hacking the car&#x27;s system so it allows you to start it...",
      "time": 1648829715,
      "type": "comment"
    },
    {
      "by": "rob74",
      "id": 30879639,
      "parent": 30878953,
      "text": "Not sure if this is specific to Porsches, I think several factors are at play here: (1) old cars (even Porsches) were not so precision-engineered as they are today. Today you can operate the gear shift using only two fingers, not so in the seventies; (2) of course, a car being ~50 years old doesn&#x27;t help either...",
      "time": 1648828978,
      "type": "comment"
    }
  ],
  "temporallobe": [
    {
      "by": "temporallobe",
      "id": 30885394,
      "parent": 30878489,
      "text": "In the U.S., we have a joke that the only anti-theft device you’ll ever need is a manual transmission.",
      "time": 1648866606,
      "type": "comment"
    }
  ],
  "kstrauser": [
    {
      "by": "kstrauser",
      "id": 30879069,
      "parent": 30878489,
      "text": "My first car was a 68 Mustang, which was a gorgeous heap of junk. At one point, the clutch just completely gave up and wedged itself in the “engaged” position. To get the car moving, I had to kill the engine, put it in 1st gear, and turn the key to run the starter. This pulled the whole car into enough motion to get the engine going, then I could synchro shift all I wanted until it came time to stop again. For that cursed month, I got very good at finding routes that didn’t involve stop lights or long lines of slow moving traffic.",
      "time": 1648826534,
      "type": "comment"
    },
    {
      "by": "kstrauser",
      "id": 30879400,
      "parent": 30879294,
      "text": "I love it.<p>On the plus side, I learned so much about how cars work that I can fix a lot of things now. My personal peak was going from “uh-oh, the alternator on the Oldsmobile died” to having replaced it with a new one from the store in 43 minutes.",
      "time": 1648827896,
      "type": "comment"
    },
    {
      "by": "kstrauser",
      "id": 30879493,
      "parent": 30879375,
      "text": "I was broke! That was my only option, so I did what I had to do. I lived in a much smaller city than you, though, so I didn’t have nearly the traffic to contend with.<p>Dopey young me with the car: <a href=\"https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;hbRLpO2\" rel=\"nofollow\">https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;hbRLpO2</a>",
      "time": 1648828320,
      "type": "comment"
    },
    {
      "by": "kstrauser",
      "id": 30880208,
      "parent": 30879580,
      "text": "My dad had a good collection of tools, and I bought a Chilton&#x27;s manual from the shop. Between the two of them, I basically had a years-long shop class with illustrated instructions on doing basically any repair to a car. It was a great way to learn some engineering skills, too: once you learned how a part was meant to work, you could better reason about how to repair or replace it. Jalopy though it was, I loved learning how to fix it.<p>That said, although the barrier to learning is much higher now, I appreciate that our Toyota never needs any repairs of any kind. It just boringly starts and drives, every day, in all conditions.",
      "time": 1648831269,
      "type": "comment"
    }
  ],
  "abruzzi": [
    {
      "by": "abruzzi",
      "id": 30883629,
      "parent": 30878489,
      "text": "914s had an engine and transmission from the VW Bus.  Since the VW Bus had a rear engine setup the shift rod was straight into the very front of the transaxle.  IIRC, when they reversed the transmission to put the engine in front of the transmission, the shift input eas now in the very rear so the shift rod started in the middle&#x2F;front of the car, had to transit back, around the engine and transaxle assembly then completely reverse into the what was now the very rear of the transmission.  Which is why the 914s were notorious for sloppy transmissions.  Later years of 914 made a change in the transmission so the shift rod entered the side of the transmission, which probably helped a little.",
      "time": 1648849385,
      "type": "comment"
    }
  ],
  "Animats": [
    {
      "by": "Animats",
      "id": 30882252,
      "parent": 30878489,
      "text": "A friend of mine still has a Porsche 914, in a barn in Northern California. It hasn&#x27;t moved in years. Her son, who was really into cars, once wanted to restore it. He&#x27;s now an design engineer with Toyota and has more old vehicles than he needs, including a 1958 Ford Fairlane Skyliner with the roof that disassembles and stores itself in the trunk.<p>If someone really wants to buy the old Porsche, send me a message.",
      "time": 1648841031,
      "type": "comment"
    }
  ],
  "Damogran6": [
    {
      "by": "Damogran6",
      "id": 30879434,
      "parent": 30878489,
      "text": "1970 olds cutlass: Stomp, hold at 15%, crank...then stab repeatedly until it can clear itself out and maintin an idle. Good for -20 to 95 F.<p>1966 Fleetwood 75 - If it&#x27;s sat for more than three weeks: Stab to set choke. Crank, pausing every 10 seconds...it&#x27;s got a LONG way to pump the fuel and you don&#x27;t want to overheat the starter. Car will then, if driven weekly, start on the first half of the first crank every time. Battery has gone 14 months without a tender or external charge and continues to start the car just fine.",
      "time": 1648828047,
      "type": "comment"
    }
  ],
  "danboarder": [
    {
      "by": "danboarder",
      "id": 30880237,
      "parent": 30878489,
      "text": "I regularly drive a 1973 VW westy (bus camper van) and it has these same type of quirks!  For me they are all second nature after having the vehicle for over 10 years.<p>I one had to leave it in a parking lot and later have it towed while I was at work. The tow truck driver could not figure out how to get it started even with me walking him through it on the phone! The ignition is &#x27;wiggly&#x27; where it won&#x27;t start until you jiggle the steering wheel to allow the key to turn to start the car. Also a screwdriver will work fine (if you wiggle the steering wheel just right while attempting to turn the ignition). So ya, Similar quirks :).<p>I love our westy and usually take it to the beach to surf. It also has an old air-cooled 914 pancake engine in it.",
      "time": 1648831343,
      "type": "comment"
    }
  ],
  "chiefgeek": [
    {
      "by": "chiefgeek",
      "id": 30879617,
      "parent": 30878489,
      "text": "Great article. My first car was a 1966 MG Midget (with a &#x27;71 engine). Gas gauge never worked. Voltage regulator broke at some point so it had to be push started (no hills in Florida made this more fun) and the first winter I had it I kept waking up with a headache. Finally traced it to a cracked exhaust manifold. First time I had driven around with the top up and I was getting gassed by CO. When the transmission failed, my buddy and I pulled the engine with an aluminum extension ladder (you couldn&#x27;t just drop the tranny due to a frame piece across the trans tunnel). Had the tranny rebuilt, put it back together (with an engine lift) and it turned out they hadn&#x27;t done it correctly. Rinse repeat....",
      "time": 1648828881,
      "type": "comment"
    }
  ],
  "HeyLaughingBoy": [
    {
      "by": "HeyLaughingBoy",
      "id": 30882661,
      "parent": 30878489,
      "text": "&gt;  starter is too weak to crank the clutch-transmission input shaft assembly with any success<p>[giggle]\nThis reminds me of putting my Toyota 4x4 (Hilux) in 4-Low, First gear, pressing the Clutch Start Cancel switch and turning the ignition key, making it an electric vehicle for a few seconds. The starter was powerful enough to move the truck uphill in that gear on its own until the engine started.",
      "time": 1648843250,
      "type": "comment"
    },
    {
      "by": "HeyLaughingBoy",
      "id": 30883159,
      "parent": 30880719,
      "text": "Never drove a Miata, but I have a Nissan 350Z and the wife has been able to squeeze 4 adults (including herself) into it. I still can&#x27;t imagine that someone willingly scrunched themselves into the hatchback under the strut brace. I guess when you&#x27;re drunk and only have one safe way home, whatever works, works.",
      "time": 1648846147,
      "type": "comment"
    }
  ],
  "deltarholamda": [
    {
      "by": "deltarholamda",
      "id": 30880827,
      "parent": 30878489,
      "text": "I laughed out loud several times at this.<p>It&#x27;s kind of sad that a lot of younger folks won&#x27;t have this kind of experience. Muscling a 1973 Ford F150 around with no power steering, I learned many, many things about driving. Having to do hill starts with a 3-on-the-tree, I learned many, many more.<p>A recalcitrant, finicky, or otherwise nearly broken car is a source of much distress, but also character building. And often a source of many fond rememberances--albeit far, far in the future.",
      "time": 1648834151,
      "type": "comment"
    },
    {
      "by": "deltarholamda",
      "id": 30881223,
      "parent": 30881040,
      "text": "&gt;with new cars there’s no reason to try to talk things out and reason with them because<p>...because there&#x27;s a solid chance the car will talk back.<p>Welcome to the future! Your car will sass you, and you will like it!",
      "time": 1648835859,
      "type": "comment"
    }
  ],
  "jamroom": [
    {
      "by": "jamroom",
      "id": 30878810,
      "parent": 30878489,
      "text": "As someone who drove a 1972 Westfalia for ~10 years this had me laughing to myself multiple times in agreement.",
      "time": 1648825452,
      "type": "comment"
    },
    {
      "by": "jamroom",
      "id": 30879303,
      "parent": 30879065,
      "text": "Yes the gears!  The amount of &quot;play&quot; in the gearbox was insane.  Couple that with the like 3 foot long stick handle and IN GEAR I could wiggle the stick in a like foot wide circle.<p>Once you had driven it for a while you got to know the &quot;feel&quot; of it and had no problems, but like in the article someone new to driving it would have had a really hard time lol.",
      "time": 1648827524,
      "type": "comment"
    }
  ],
  "Havoc": [
    {
      "by": "Havoc",
      "id": 30883622,
      "parent": 30878489,
      "text": "Fine writing.<p>Frankly I&#x27;m more intrigued by the fact that this seems to have gotten an easy #1 spot on hn. Writing about sketchy clutches on old cars does not generally attract wide hn acclaim.<p>I&#x27;d love to hear opinions as to what made the difference...clearly something here is different.",
      "time": 1648849360,
      "type": "comment"
    }
  ],
  "porknubbins": [
    {
      "by": "porknubbins",
      "id": 30886205,
      "parent": 30878489,
      "text": "I love this because I just realized pretty much all my vehicles small engine equipment have quirks that they only start up if you know the correct procedure, yet I consider them to be 100% working. Not to mention my pc&#x27;s boot menu which defaults to a dead operating system after 10 seconds, that I have been too lazy to figure out how to reorder.",
      "time": 1648880296,
      "type": "comment"
    }
  ],
  "sethammons": [
    {
      "by": "sethammons",
      "id": 30884306,
      "parent": 30878489,
      "text": "This was fun. It reminds me of my first truck that my uncle gifted me in sometime around the year 2001: a mid &#x27;80s GMC S-15 light pickup truck.<p>The starter did not work. This meant parking on a hill always and &#x27;pop starting.&#x27; You put it in 2nd gear, get a good rolling start, then crank the engine. Be mindful to not run out of runway.<p>This was alleviated after a year or two when a friend of my mom showed me how to arc the starter directly. Pop the hood, take a screw driver and connect the two opposing bolts on the starter. A shower of sparks and a section of screwdriver missing later and, boom, a running engine. It was true freedom not having to park on a hill anymore!<p>You couldn&#x27;t start or stop too fast. The bench seat&#x27;s lock failed, so the entire bench seat would shift forward or backward if you changed velocity too quickly. A tight seat belt helped by using you to keep the seat back.<p>The driver side window went halfway down... usually. You had to press against it just right and you had to pull up on it to help the hand crank lift it. Best to just leave it up.<p>Onto the instruments. On a hard left hand turn, the radio and dashboard would light up ... until the end of the turn. Otherwise, no dash lights and no radio. The other problem with the left hand turn was that if it was too sharp, the keys would fly from the ignition and land on the passenger floor board. But that was ok because the truck would continue to run.<p>Turning on the headlights would cause the gas gauge to drop to zero. This was a problem at night since due to the lack of dash lights. To check the gas, you had to turn off the headlights and use a flashlight to see the fuel level.<p>Thinking of levels of fluids: oil. There was no dip stick and it burnt oil. So you mostly guessed daily how much oil to add based on experience. Somehow it never occurred to me to, you know, purchase a dip stick. I grew up poor, you didn&#x27;t just buy things. And I didn&#x27;t think to make a makeshift one because I was inexperienced at life with little guidance.<p>One night in 16 degree fahrenheit, icy weather, and not dressed for said weather, the truck gave up the ghost. I didn&#x27;t estimate my remaining oil correctly and seized the engine. The wrecker gave me $35 for the truck and drove off into the sunset the following day.",
      "time": 1648855190,
      "type": "comment"
    },
    {
      "by": "sethammons",
      "id": 30884356,
      "parent": 30878751,
      "text": "I left my key in. Pop and sparks and a running engine immediately (gmc s-15)",
      "time": 1648855655,
      "type": "comment"
    }
  ],
  "softwarebeware": [
    {
      "by": "softwarebeware",
      "id": 30879575,
      "parent": 30878489,
      "text": "What an awesome read! It brought back some nostalgia. In high school, I owned a 1976 Datsun 280Z which had some, shall we say, electrical problems. The ignition went out but somehow I had ascertained that by placing the blade of a screwdriver across two fuses it would (for mysterious reasons) turn the starter over and that was the only way to start the car.",
      "time": 1648828690,
      "type": "comment"
    }
  ],
  "acjacobson": [
    {
      "by": "acjacobson",
      "id": 30882830,
      "parent": 30878489,
      "text": "My family kind of prides itself on driving manual cars even though you have to go to extra effort to buy them new in the U.S. these days. Once my Dad brought one of them into a mechanic for an oil change and the guy asked &#x27;How do you like your anti-theft device?&#x27; My Dad was a bit puzzled because there was no extra alarm or device he could think of, but the mechanic meant the stick shift. Apparently manual cars are now so uncommon that your average car thief doesn&#x27;t know how to drive one away - so it&#x27;s kind of a surprising that someone got this 914 as far down the road as he did.",
      "time": 1648844143,
      "type": "comment"
    }
  ],
  "emsy": [
    {
      "by": "emsy",
      "id": 30878730,
      "parent": 30878489,
      "text": "I love seeing old timers on the street. The ones that get preserved are usually so much more aesthetic than contemporary cars.",
      "time": 1648825181,
      "type": "comment"
    }
  ],
  "frxx": [
    {
      "by": "frxx",
      "id": 30884086,
      "parent": 30878489,
      "text": "Sounds like the car in this state should be illegal to drive for several reasons. I&#x27;m glad that in many countries the cars need to be checked every two years.",
      "time": 1648853152,
      "type": "comment"
    }
  ],
  "linksnapzz": [
    {
      "by": "linksnapzz",
      "id": 30879104,
      "parent": 30878489,
      "text": "Oh this is lovely. As someone who has spent time inside a Karmann-Ghia convertible, I can smell the burning oil now....",
      "time": 1648826699,
      "type": "comment"
    }
  ],
  "SLWW": [
    {
      "by": "SLWW",
      "id": 30882877,
      "parent": 30878489,
      "text": "The section about starting the car rings true for just about every old car I own.<p>My Dart, an ol&#x27; 4 door from &#x27;69 has this really cool thing were in the event you do get the cruel idea to wake her up on a cold morning; you&#x27;ll end up doing three sets of ignition on, wait 3-5 seconds, ignition off, pump the gas pedal a few times (first set 20, then 10, then 5) and if you haven&#x27;t deviated from this formula you should be able to start the engine.  After about 3 seconds she will be quietly resting once more, then you can attempt to wake her again, this time once you hear the engine come to life you need to ease onto the accelerator, and hold it at an obnoxiously loud &quot;idle&quot; for about 1-2 minute.  Then from there you will put her in first, and while still tickling the accelerator, release the brake slowly (this girl is a TorqueFlite auto transmission).<p>Though i love that car because i drove it as my daily for several months during the cold winter... it had no heater, no defrost and no hope of going highway speeds safely (though I have flown at 80 mph before, down a hill in neutral, that was terrifying), you have to bleed the brakes once every two months or she will try to kill you.. and she&#x27;s unapologetically mine, for fear of the guilt I would incur if i sold her to someone that she accidentally ends up killing and my undying love for a car that usually got me to where i need to be (12 mpg, 91 oct).",
      "time": 1648844426,
      "type": "comment"
    }
  ],
  "bluetomcat": [
    {
      "by": "bluetomcat",
      "id": 30879912,
      "parent": 30878489,
      "text": "Almost any 30+ year-old vehicle is full of these special quirks requiring special &quot;rituals&quot;. The annoying thing is that they are hard to fix and often require rare parts which are not easily available.<p>I have a &#x27;95 Rover 216 Coupe which is mechanically very solid (Honda engine and running gear) and very well maintained, but the rest of the car is full of quirks caused by age deterioration. The numerous &quot;rituals&quot; include things like never closing your frameless door with the window down (a nasty cracking sound follows), manually pulling the tooth of the release latch before closing the boot, care when washing it so not to let water enter the spare wheel area permanently and cause rust, etc.",
      "time": 1648830100,
      "type": "comment"
    }
  ],
  "cenazoic": [
    {
      "by": "cenazoic",
      "id": 30880189,
      "parent": 30878489,
      "text": "All I could think about was how I should write something similar about my belovedly-wretched 1979 MGB.<p>Lucas, the manufacturer of many MG parts, colloquially known as ‘the Prince of Darkness’ because of a tendency for the lights to suddenly stop working.<p>The tell-tale crimp in many trunk lids, caused by attempting to shut it without disengaging the little rod that kept it open.<p>Don’t bother locking the doors if you don’t want the expensive convertible top sliced through.<p>The battery is behind the passenger seat.<p>Having the reverse gear go out leads to an interesting perspective change while parking&#x2F;driving.<p>I ended up going to votech in auto mechanics because of this car, because I got so irritated about getting ripped off.<p>Ah well, I love the damn thing.  Even now, 10 years after I sold it.",
      "time": 1648831146,
      "type": "comment"
    }
  ],
  "duxup": [
    {
      "by": "duxup",
      "id": 30878729,
      "parent": 30878489,
      "text": "This remind me of how amazingly complex a modern car is in terms of making it easy to drive and how may iterations &#x2F; how much evolution has taken place.",
      "time": 1648825176,
      "type": "comment"
    }
  ],
  "Terry_Roll": [
    {
      "by": "Terry_Roll",
      "id": 30882250,
      "parent": 30878489,
      "text": "Well if he needs help with his 914 and can ship it to Europe, Von Schmidt have done a really nice job with this one \n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=dzVr4cpNC58\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=dzVr4cpNC58</a>\nwww.schmidt-oss.com&#x2F;von-schmidt-eng&#x2F;<p>Even electric motor conversions in older cars are coming along as seen here\n<a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;qpcSF1kRcFY?t=55\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;qpcSF1kRcFY?t=55</a>",
      "time": 1648841027,
      "type": "comment"
    }
  ],
  "incanus77": [
    {
      "by": "incanus77",
      "id": 30884958,
      "parent": 30878489,
      "text": "I drive&#x2F;maintain&#x2F;am tortured by a 1985 VW Vanagon and so much of this rings true. The variety of tricks, quirks, smells, sounds, and special tools&#x2F;rags&#x2F;spots to hit just right to sustain a trip down the road are surprisingly similar.",
      "time": 1648861597,
      "type": "comment"
    }
  ],
  "MauranKilom": [
    {
      "by": "MauranKilom",
      "id": 30881411,
      "parent": 30878489,
      "text": "Today I learned that the literal &quot;giving up the ghost&quot; translation of the German &quot;den Geist aufgeben&quot; is correct, even though it just screams &quot;false friend&quot;. Huh!",
      "time": 1648836601,
      "type": "comment"
    }
  ],
  "rebuilder": [
    {
      "by": "rebuilder",
      "id": 30882353,
      "parent": 30878489,
      "text": "When I was a kid, we had a succession of dubious used cars, at least two of which were Ladas. They were fine cars - spare parts were easy to get and you needed them often.<p>One time, someone broke into one of the Ladas. No problem for us, it was hard to start even with a key and the would-be auto thief apparently couldn’t get it going. Who needs an alarm?",
      "time": 1648841591,
      "type": "comment"
    }
  ],
  "JBiserkov": [
    {
      "by": "JBiserkov",
      "id": 30885779,
      "parent": 30878489,
      "text": "“We use cookies to personalize your experience, to provide social media features and to analyze our traffic. We also share information about your use of our site with our social media, advertising and analytics partners.“<p>This was the only text that was visible below the title and author byline.",
      "time": 1648872430,
      "type": "comment"
    }
  ],
  "drewg123": [
    {
      "by": "drewg123",
      "id": 30883368,
      "parent": 30878489,
      "text": "My first car was a 22 year old (at the time) 1964 Triumph TR4 that my dad and I found in a barn.   A lot of the issues in this 914 were present on my car as well.  My car had a minor engine oil leak, and the oil would drip onto the exhaust system and fill the cabin with smoke.  I remember when the brakes went out and I drove the car ~25 miles with nothing but the parking brake.<p>The best was when I got out of this tiny car with manual everything and drove the land-yacht Pontiac Parisienne we used for driver&#x27;s ed in highschool.  Its brakes were so sensitive, and I was so used to having to use a <i>LOT</i> of force to stop the TR4, that the first few times I&#x27;d stop the car everybody&#x27;s seatbelt would lock up.",
      "time": 1648847618,
      "type": "comment"
    }
  ],
  "fabioborellini": [
    {
      "by": "fabioborellini",
      "id": 30878928,
      "parent": 30878489,
      "text": "So, apparently there is no mandatory vehicle inspection in the US. Of course there isn&#x27;t, it would violate the freedom to drive with an unroadworthy car.",
      "time": 1648825911,
      "type": "comment"
    }
  ],
  "todd8": [
    {
      "by": "todd8",
      "id": 30880748,
      "parent": 30878489,
      "text": "There wasn&#x27;t very good public transportation to Wellesley College from Boston in 1970 so I borrowed a friend&#x27;s car to pick up my date. The car was old enough even then to have a crank handle stowed behind the driver&#x27;s seat for starting the car when you weren&#x27;t parked at the top of a hill. That date didn&#x27;t go so well!",
      "time": 1648833753,
      "type": "comment"
    }
  ],
  "Melatonic": [
    {
      "by": "Melatonic",
      "id": 30882322,
      "parent": 30878489,
      "text": "These things are an absolute BLAST to drive but you also feel like you are literally driving a tin can - I do NOT want to think about what would happen if you got into an accident with a larger vehicle like an SUV<p>Met a guy that threw a V8 in one of these - must have been absolutely insane.",
      "time": 1648841440,
      "type": "comment"
    },
    {
      "by": "Melatonic",
      "id": 30882335,
      "parent": 30879759,
      "text": "I had an early 944 - it basically had all of the negatives of the 924 and only a few positives :-D",
      "time": 1648841505,
      "type": "comment"
    },
    {
      "by": "Melatonic",
      "id": 30883813,
      "parent": 30883688,
      "text": "968 FTW<p>I still want to buy a later model 90s one, throw an LS7 in there, and overhaul the interior. Would be an amazing vehicle.",
      "time": 1648850816,
      "type": "comment"
    }
  ],
  "bbarn": [
    {
      "by": "bbarn",
      "id": 30878727,
      "parent": 30878489,
      "text": "Wow, I could write almost the same article about my &#x27;85 Westfalia Vanagon.",
      "time": 1648825173,
      "type": "comment"
    }
  ],
  "tibbydudeza": [
    {
      "by": "tibbydudeza",
      "id": 30880986,
      "parent": 30878489,
      "text": "I am rather glad that modern cars late 90&#x27;s are so depressingly reliable and lacking in &quot;character&quot; and just works when I turn the key and all they needs is fuel, oil change, filters and fluids at intervals.<p>I would choose an Audi&#x2F;BMW if I wanted that sort trepidation in my life.",
      "time": 1648834817,
      "type": "comment"
    }
  ],
  "stblack": [
    {
      "by": "stblack",
      "id": 30885173,
      "parent": 30878489,
      "text": "Great article indeed.<p>Inquiring mind wants to know, push rods or overhead cams?<p>According to Wikipedia, the 914 could have either.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Porsche_914#Technical_specifications_of_the_standard_versions\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Porsche_914#Technical_specific...</a>",
      "time": 1648864068,
      "type": "comment"
    }
  ],
  "rackjack": [
    {
      "by": "rackjack",
      "id": 30879145,
      "parent": 30878489,
      "text": "This is a very funny article and the reveal that people have actually tried to steal the car was a perfect closer.",
      "time": 1648826881,
      "type": "comment"
    }
  ],
  "eyelidlessness": [
    {
      "by": "eyelidlessness",
      "id": 30884976,
      "parent": 30878489,
      "text": "I think my 87 Jetta (purchased in 2002, died and abandoned 2000ish miles or so moving 3000 miles US coast to coast) very closely resembled these remarks. Of course no one wanted to steal it. But I appreciate the author’s portrayal! And it was a really fun weird way to feel like I’ve owned a Porsche!",
      "time": 1648861765,
      "type": "comment"
    }
  ],
  "eichin": [
    {
      "by": "eichin",
      "id": 30885908,
      "parent": 30878489,
      "text": "&gt; exactly 4 pumps\n&gt; start\n&gt; exactly 2 pumps<p>... does this sound to anyone else like he&#x27;s basically got a Permissive Action Link protecting his car?",
      "time": 1648875119,
      "type": "comment"
    }
  ],
  "aplkorex": [
    {
      "by": "aplkorex",
      "id": 30882674,
      "parent": 30878489,
      "text": "THANK YOU for this! It&#x27;s been a while since I&#x27;ve laughed out loud while reading an article on the web. As an owner of an ancient Land Rover, I feel this, physically.<p>Excellent writing.",
      "time": 1648843330,
      "type": "comment"
    }
  ],
  "dghughes": [
    {
      "by": "dghughes",
      "id": 30885536,
      "parent": 30878489,
      "text": "I like the 914 it&#x27;s much nicer than the 924 since the 914 is a boxer the 924 a inline 4. A Dino Ferrari would another good choice small displacement short stroke V6s are sexy.",
      "time": 1648868727,
      "type": "comment"
    }
  ],
  "swamp40": [
    {
      "by": "swamp40",
      "id": 30880339,
      "parent": 30878489,
      "text": "Fantastic writing.<p>A lot of 1970&#x27;s manual transmission cars were like this.  I had an early 70&#x27;s AMC Gremlin.  The shift knob was just a vertical rectangular rod.  The transmission linkage were two parallel horizontal rods with a notch cut in each.  The vertical rod just floated between these, and you had to pull left or right and slide back or forth until you found one of the notches - then once you were engaged, you could push or pull the linkage to go into a gear.  When the knob drifted, you really had to have a visual in your head of where the notches were and what gear you where in.",
      "time": 1648831749,
      "type": "comment"
    }
  ],
  "interactivecode": [
    {
      "by": "interactivecode",
      "id": 30879282,
      "parent": 30878489,
      "text": "Can I just say this is such a lovely site design. fast, clean and very readable. Bravo!",
      "time": 1648827455,
      "type": "comment"
    }
  ],
  "alkaloid": [
    {
      "by": "alkaloid",
      "id": 30879671,
      "parent": 30878489,
      "text": "This makes me miss my 1971 VW Van. Learning to navigate the front-to-back, 3-meter-long transmission linkage made it to where I can drive literally any standard transmission vehicle on the planet. Well done!",
      "time": 1648829123,
      "type": "comment"
    }
  ],
  "BubbleRings": [
    {
      "by": "BubbleRings",
      "id": 30882211,
      "parent": 30878489,
      "text": "Great writing. Makes me want to revisit Hitchhikers Guide.",
      "time": 1648840743,
      "type": "comment"
    }
  ],
  "jacquesm": [
    {
      "by": "jacquesm",
      "id": 30883419,
      "parent": 30878489,
      "text": "Very recognizable :) I had a Citroen DS that had locks that were so bad that it was pointless to try to lock it, and getting it started required 10 steps or so and getting one wrong meant you weren&#x27;t driving that day (or at least, not until the excess fuel had evaporated away again).<p>Probably more secure than the class-5 alarm on my current car :)",
      "time": 1648847942,
      "type": "comment"
    },
    {
      "by": "jacquesm",
      "id": 30883249,
      "parent": 30878755,
      "text": "Likely not enough lubrication happening. Pity, that engine would have been perfectly good if it had been treated a bit more carefully, and a matching numbers 914 would be worth something today. They&#x27;re a very interesting car, mid engined lightweight sports car that handles a lot better than you would expect from something that old.<p>There was a six cylinder version of this as well (super rare) and they made a prototype 914&#x2F;8 which was never offered for sale, afaik only two were made (one for Ferdinand Porsche, one for Ferdinand Piëch).",
      "time": 1648846739,
      "type": "comment"
    },
    {
      "by": "jacquesm",
      "id": 30883265,
      "parent": 30880794,
      "text": "All true, but a pack that has been in a crash might be broken in subtle and hard to detect ways. A short <i>in</i> the pack would be a quick way to ruin your day.",
      "time": 1648846876,
      "type": "comment"
    }
  ],
  "zw123456": [
    {
      "by": "zw123456",
      "id": 30881938,
      "parent": 30878489,
      "text": "This reminds me of back when I was at Bell Labs back in the 1980&#x27;s and there was a &quot;user manual&quot; of how to crash the Unix OS on the PDP11&#x27;s in our lab.  The idea being if you just tell people how to do it they won&#x27;t try to show how clever they were by doing it. Also, it was a warning what not to do, but it also discouraged anyone from thinking they found a new flaw or whatever.",
      "time": 1648839196,
      "type": "comment"
    }
  ],
  "ChuckMcM": [
    {
      "by": "ChuckMcM",
      "id": 30880716,
      "parent": 30878489,
      "text": "Ah yes, the much maligned (legitimately!) Porsche 914. In high school a friend of mine &quot;scored&quot; one of these &quot;for a steal&quot; from a used car dealer. It managed to wear out the enthusiasm of even a testosterone fueled high school car enthusiast! He sold it his senior year, for not quite as much as he paid for it, and had invested probably $8,000 in various repairs and improvements over the two years he owned it. Quite the legacy.",
      "time": 1648833597,
      "type": "comment"
    }
  ],
  "gabereiser": [
    {
      "by": "gabereiser",
      "id": 30882866,
      "parent": 30878489,
      "text": "I love this. It brings back memories of my first car. A ‘86 GT with a horse logo. I remember driving with my sister one day, explaining all the things that are wrong with it and my ingenious work arounds to justify it. Then her door swung open taking a turn too fast and she refused to ever ride in the car again.<p>This was a great read, thank you.",
      "time": 1648844380,
      "type": "comment"
    }
  ],
  "orangepurple": [
    {
      "by": "orangepurple",
      "id": 30879280,
      "parent": 30878489,
      "text": "I used to bother with mechanical junk like this when I was younger. I bought 10 cars under $1000 and repaired everything from shattered valvetrain to clogged fuel filters. These days if I wanted to drive a junk car with a good brand I would LS swap it and call it a day. It&#x27;s more important to treat cancer before it metastasizes unlike the hospice care this person is giving that car. It troubles me to see people suffering with total junk just because it has a brand association.",
      "time": 1648827451,
      "type": "comment"
    },
    {
      "by": "orangepurple",
      "id": 30880174,
      "parent": 30879578,
      "text": "As a tribute to your memories of driving an older Porsche 911 properly:<p>The Porsche 911 Yellow Bird 50fps hot lap around the Nürburgring:\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ZzjQXxktxbs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ZzjQXxktxbs</a>",
      "time": 1648831103,
      "type": "comment"
    },
    {
      "by": "orangepurple",
      "id": 30880004,
      "parent": 30879716,
      "text": "I agree with you. In the case of this article the original parts were too far gone.<p>I do appreciate the physical aesthetics of older devices and would not vandalize functional and maintainable internals unless they caused extreme hardship.",
      "time": 1648830446,
      "type": "comment"
    },
    {
      "by": "orangepurple",
      "id": 30880025,
      "parent": 30879943,
      "text": "Agreed. I am very uncomfortable letting a car rot anywhere though. I&#x27;d rather see it shredded and recycled. Then again I don&#x27;t deify brands like I sort of did when I was younger.<p>At this point that car needs to be completely disassembled to bare metal, power washed, welding repaired, sandblasted, repainted, and totally rebuilt. With so much damage all that remains is nothing but hospice care.",
      "time": 1648830566,
      "type": "comment"
    }
  ],
  "indus": [
    {
      "by": "indus",
      "id": 30885938,
      "parent": 30878489,
      "text": "I love the upcoming downturn in tech, more posts like these would trend ;-)",
      "time": 1648875496,
      "type": "comment"
    }
  ],
  "nilsbunger": [
    {
      "by": "nilsbunger",
      "id": 30882978,
      "parent": 30878489,
      "text": "The article and the picture at the bottom exude that this guy is doing exactly what he loves.",
      "time": 1648845000,
      "type": "comment"
    }
  ],
  "clajiness": [
    {
      "by": "clajiness",
      "id": 30878959,
      "parent": 30878489,
      "text": "My Saab 900 Turbo feels like a brand new car now.",
      "time": 1648826035,
      "type": "comment"
    }
  ],
  "jonsully": [
    {
      "by": "jonsully",
      "id": 30881059,
      "parent": 30878489,
      "text": "This has got to be one of the very best and most hilarious articles I&#x27;ve read this year. Bravo, sir.",
      "time": 1648835110,
      "type": "comment"
    }
  ],
  "DocG": [
    {
      "by": "DocG",
      "id": 30878831,
      "parent": 30878489,
      "text": "Not loading to me anymore\n<a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220401144722&#x2F;https:&#x2F;&#x2F;www.hagerty.com&#x2F;media&#x2F;advice&#x2F;a-few-things-to-know-before-you-steal-my-914&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220401144722&#x2F;https:&#x2F;&#x2F;www.hager...</a>",
      "time": 1648825522,
      "type": "comment"
    }
  ],
  "eek2121": [
    {
      "by": "eek2121",
      "id": 30885766,
      "parent": 30878489,
      "text": "FYI his car was stolen last week. Successfully I might add*.",
      "time": 1648872118,
      "type": "comment"
    }
  ],
  "rcpt": [
    {
      "by": "rcpt",
      "id": 30883607,
      "parent": 30878489,
      "text": "Great writing and nice to see people who enjoy their hobbies but jfc this kind of thing shouldn&#x27;t be allowed on public roads.",
      "time": 1648849309,
      "type": "comment"
    }
  ],
  "iancmceachern": [
    {
      "by": "iancmceachern",
      "id": 30880984,
      "parent": 30878489,
      "text": "I had a friend that drilled a hole in the fender and put in another key operated switch  there.  Simple but effective.  No one stealing a car is looking around for other switches.",
      "time": 1648834813,
      "type": "comment"
    }
  ],
  "TacticalCoder": [
    {
      "by": "TacticalCoder",
      "id": 30879578,
      "parent": 30878489,
      "text": "Don&#x27;t know why this is top post: there must be some petrolheads on HN.<p>This resonates with me: I&#x27;ve got an old, kinda beaten up, &quot;sister&quot; of that 914: an old Porsche 911.  I&#x27;ve got it since 22 years and it&#x27;s 33 years old atm (so 2&#x2F;3rd of its life with me).  Over the decades I only ever put oil and gasoline in that thing (ok, ok, the fuel pump died once and it was a 100 EUR part).  Every single time I hook the battery up, it starts... While doing some blue smoke, granted.  Although back from 1999 to 2004 I drove this beauty daily, since 2004 it&#x27;s a garage queen: a piece of art that hardly ever hits the road.  It&#x27;s also prevented from seeing <i>any</i> kind of water: no rain water, no cleaning water (I much rather scratch the paint a tiny bit with microfibers towels and &quot;dry cleaning&quot; detailers or whatnots than risk having water idling for months in some sneaky spot and create corrosion).<p>Original paint (hardly anyone still has this).  First clutch (yup: same clutch since 33 years): this one is so rare it&#x27;s actually problematic because my MY has a clutch that&#x27;s not made anymore and there&#x27;s some modification that needs to be done...  But not a single mechanic know anymore what needs to be done to adapt a &quot;still made&quot; clutch on mine (basically a 1988&#x2F;1989 clutch <i>will not</i> work on a 1987 if the 1987 is still on its first clutch for it hasn&#x27;t seen the mandatory mod done).  Tires are from... 2004 (yes it&#x27;s illegal and, no, I don&#x27;t care seen how I drive it).  About twice a year, on a non-rainy day, the old lady starts and goes for a drive around the block at 20 mph.   And then back into the garage.<p>One day I should probably have it restored: the problem is these old Porsche engines (all 911 pre the 993 model) are notorious for their long bolts breaking when trying to adjust the timing.  So a restoration means taking the engine out.  That&#x27;d set me $10K easily I think with all that needs to be done.<p>And in the end I&#x27;ll have a polluting gas-guzzler which I&#x27;ll feel bad using anyway.<p>No really: old cars are also great as art pieces that hardly ever go out.<p>Some people like to collect them, others like to drive them, others like to restore them (met a gentleman the other day whose passion was neither driving nor collecting but restoring incredible cars).  I&#x27;m sure some even like to <i>write</i> about them!<p>And don&#x27;t get me started on my even crankiest old italian car! (this one won&#x27;t shift into 2nd when the gearbox is cold, so it&#x27;s 1st to 3rd gear during the first x minutes of driving... But being italian, of course, it&#x27;s not starting anymore and needs to go see a mechanic).<p>As I&#x27;m a recovering petrolhead I begin to see these more and more as art pieces: weird remnants of an insanely dangerous (and polluting) past.",
      "time": 1648828704,
      "type": "comment"
    }
  ],
  "browningstreet": [
    {
      "by": "browningstreet",
      "id": 30880260,
      "parent": 30878489,
      "text": "This reminds me of the best writing from Car and Driver magazine. They still do things like this and their annual Top 10 is rich in droll, hilarious car writing.",
      "time": 1648831451,
      "type": "comment"
    },
    {
      "by": "browningstreet",
      "id": 30880323,
      "parent": 30879508,
      "text": "My first car was a 78 Rabbit that had the push-down for R. I also had a Renault Megane that had a pull-up-collar to find R.",
      "time": 1648831665,
      "type": "comment"
    }
  ],
  "redleggedfrog": [
    {
      "by": "redleggedfrog",
      "id": 30879467,
      "parent": 30878489,
      "text": "That was really well written, and supremely entertaining.",
      "time": 1648828214,
      "type": "comment"
    }
  ],
  "kazinator": [
    {
      "by": "kazinator",
      "id": 30884912,
      "parent": 30878489,
      "text": "&gt; <i>oil vapors are exhumed from the cabin</i><p>Very creative malapropism!",
      "time": 1648861154,
      "type": "comment"
    }
  ],
  "LinuxBender": [
    {
      "by": "LinuxBender",
      "id": 30878806,
      "parent": 30878489,
      "text": "I get<p><pre><code>  Error code: SSL_ERROR_UNSAFE_NEGOTIATION\n</code></pre>\nQualys also detects that this is disabled.  I would like to see the page as I like older cars.",
      "time": 1648825443,
      "type": "comment"
    }
  ],
  "cjrp": [
    {
      "by": "cjrp",
      "id": 30879109,
      "parent": 30878489,
      "text": "It&#x27;s funny how much the starting procedure reminds me of a fairly-modern Cessna 172. If it ain&#x27;t broke...",
      "time": 1648826745,
      "type": "comment"
    }
  ],
  "GekkePrutser": [
    {
      "by": "GekkePrutser",
      "id": 30882841,
      "parent": 30878489,
      "text": "This sounds a lot like my first car. I won&#x27;t mention the model for security reasons :D (This topic is going to be a goldmine for hackers!)<p>It&#x27;s funny because I had very similar issues. In my case the gearshift link bar fell out of the bottom twice. Both cases I was parked in a high-security area at work and I had get special authorisation for the road service. To much amusement of the security staff, especially the second time which was about a week after the first.<p>Also, the lights would not auto switch off when turning off the ignition (no fancy newfangled electronics there!), but my colleagues were willing to give me a push once a week or so. All the above did give my car a very special reputation at work and it was the butt of many jokes. It also had a manual choke which caused me to empty many a fuel tank unnecessarily. I carried a 5L jerrycan around after the first time I found out what happens if you forget to switch the choke off after starting. With the choke off it would go more than 100km on this reserve!<p>The ignition switch was also so far gone it could be turned with a teaspoon, but unfortunately this worked both ways. Sometimes going over a bump in the road would flick it off. So for this reason I hotwired the foglight switch (which was rarely allowed to be used in the Netherlands, you may only use it in basically undrivable conditions) as an &quot;ignition on&quot; switch to bridge it. In this sense it was like a modern car which you can turn on with a button. For the foglight itself I just had two wires hanging under the dash which I could simply connect when needed. No need for this modern &quot;switch&quot; nonsense.<p>There was also no power steering nor braking and the engine (1.0L) was so small you could literally set foot inside the engine compartment (standing on the road as it didn&#x27;t have a bottom). My father hated me for braking so hard when I drove his car, but on mine you really had to pump it if you had any hope of stopping. Steering was super light though, even without power steering. Probably because the car weighed practically nothing, and the tyres could use a bit more grip. When I had people sitting in the back I literally had trouble steering at high speeds because there wasn&#x27;t enough weight on the front. So I would limit myself to 80km&#x2F;h on the motorway in those cases to be safe. It did have no trouble reaching 120km&#x2F;h though, to my surprise.<p>I also had to make sure not to fuel up above 80% or so because when splashing it leaked somewhere around the neck of the fuel filler pipe and the smell was horrible.<p>Still, it was MY car. My friends bought me a bumper sticker saying &quot;Laugh all you want, this one is paid off!&quot;. It was also special in the sense that it was the only car I&#x27;ve had where the (Sony) stereo was worth more than the car itself. It was one of the first with a CD player. Not that it was particularly expensive, but you probably gathered that the car was even cheaper.<p>PS: Funnily enough it passed the safety inspection twice. I did have to wire the foglight switch back up before the test though O:-)",
      "time": 1648844193,
      "type": "comment"
    }
  ],
  "dclowd9901": [
    {
      "by": "dclowd9901",
      "id": 30886409,
      "parent": 30878489,
      "text": "Beautiful treatise of the wretched joys of owning and driving an old car. What I love is how all of these foibles become second nature to the ownership. This is what car people call “character”, much the same way you might realize you need to warn one friend before you introduce them to another.<p>Though it’s usually my goal to chase all manner of unreliability out of a car I own (I confess, I absolutely love just getting in a car and driving, no fuss, no muss), there is a pang of sadness that comes with knowing I’ve made it that much more reliable, and frankly, boring.",
      "time": 1648883431,
      "type": "comment"
    },
    {
      "by": "dclowd9901",
      "id": 30886443,
      "parent": 30879068,
      "text": "Contrarily I’ve made mine incredibly easy to steal but fit it with a hidden gps so I can get it back before it’s stripped to nothing.",
      "time": 1648884058,
      "type": "comment"
    },
    {
      "by": "dclowd9901",
      "id": 30886458,
      "parent": 30878742,
      "text": "We all know those autocross guys…",
      "time": 1648884284,
      "type": "comment"
    },
    {
      "by": "dclowd9901",
      "id": 30886476,
      "parent": 30882381,
      "text": "You underestimate the enthusiasts. I just recently bought a refurbished “distance system” computer (aka cruise control ecu) for my 89 325i. I have, on order, an original head unit with blue tooth retrofitted.<p>Electronics won’t be the Achilles heel of old cars. Gasoline will be. But make no mistake. Old electric vehicles with their max 10-year life span of battery banks won’t enjoy the life of a classic either.",
      "time": 1648884510,
      "type": "comment"
    },
    {
      "by": "dclowd9901",
      "id": 30886451,
      "parent": 30879598,
      "text": "What’s that joke about “temporary fixes that work are never just temporary?”",
      "time": 1648884154,
      "type": "comment"
    }
  ],
  "jeffrallen": [
    {
      "by": "jeffrallen",
      "id": 30880538,
      "parent": 30878489,
      "text": "I need to print this out and put it in my 1974 VW camper, for my kids to read when I kick off.",
      "time": 1648832628,
      "type": "comment"
    }
  ],
  "atarian": [
    {
      "by": "atarian",
      "id": 30882156,
      "parent": 30878489,
      "text": "The ending was great. Impressive that a thief actually got that far.",
      "time": 1648840407,
      "type": "comment"
    }
  ],
  "mywittyname": [
    {
      "by": "mywittyname",
      "id": 30878672,
      "parent": 30878489,
      "text": "The joys of classic car ownership.",
      "time": 1648825004,
      "type": "comment"
    }
  ],
  "joshu": [
    {
      "by": "joshu",
      "id": 30880278,
      "parent": 30878489,
      "text": "This doesn’t sound too bad. But I also race in a 1960s british race car.",
      "time": 1648831509,
      "type": "comment"
    }
  ],
  "gedy": [
    {
      "by": "gedy",
      "id": 30879917,
      "parent": 30878489,
      "text": "My brother had one of these about 20 years ago, and he eventually sold to a guy  from other side of town.  One day a few months later the car comes pulling into his front yard at high speed and does a spin out.  The guy happened to be driving past and a front control arm snapped off due to rust, and he couldn&#x27;t control the steering.",
      "time": 1648830125,
      "type": "comment"
    }
  ],
  "rmk": [
    {
      "by": "rmk",
      "id": 30881266,
      "parent": 30878489,
      "text": "Ha! Nice piece of writing. What&#x27;s the software equivalent of this car? I&#x27;ve heard loads of complaints from Oracle software users (database excepted; it appears to be a genuinely great product).",
      "time": 1648836039,
      "type": "comment"
    },
    {
      "by": "rmk",
      "id": 30881379,
      "parent": 30879109,
      "text": "Welcome to General Aviation, where you can still experience vintage technology from the sixties and seventies! But also proof that a wimpy 180-HP thing is way more fun than a 500-HP BMW M3, simply because of the fact that it flies :)",
      "time": 1648836484,
      "type": "comment"
    }
  ],
  "nixass": [
    {
      "by": "nixass",
      "id": 30880652,
      "parent": 30878489,
      "text": "Car being manual is good protection measure in the USA",
      "time": 1648833247,
      "type": "comment"
    }
  ],
  "alx__": [
    {
      "by": "alx__",
      "id": 30880814,
      "parent": 30878489,
      "text": "Remind me of trying to get a dev environment setup at this one company 5 years ago. The list of troubleshooting items was longer than the list to get it running :D",
      "time": 1648834063,
      "type": "comment"
    }
  ],
  "aspyct": [
    {
      "by": "aspyct",
      "id": 30878911,
      "parent": 30878489,
      "text": "Oh that&#x27;s a good read. Thanks for sharing :)",
      "time": 1648825852,
      "type": "comment"
    }
  ],
  "jmkni": [
    {
      "by": "jmkni",
      "id": 30879381,
      "parent": 30878489,
      "text": "This was a really pleasant read, bravo!",
      "time": 1648827826,
      "type": "comment"
    }
  ],
  "zdwolfe": [
    {
      "by": "zdwolfe",
      "id": 30881249,
      "parent": 30878489,
      "text": "This was a joy to read.",
      "time": 1648835954,
      "type": "comment"
    }
  ],
  "bsenftner": [
    {
      "by": "bsenftner",
      "id": 30879242,
      "parent": 30878489,
      "text": "I lived for over 20 years a half mile from the Bob&#x27;s Big Boy restaurant with car service in Burbank, CA, where the S. California Classic Car Club has their weekly meet up and show case. Every single friday night, a dream series of amazing autos and the fanatics that keep them running show up and bait everyone with their jewels. My dad was a car dealer and I grew up with him restoring classics, so I know the dedication they require. Yet, a half dozen times I nearly talked myself into buying one of those beauties on the spot. Closest I came was a running, but yet to be fully restored Model A that some 50&#x27;s teen made a hot rod. That 50&#x27;s teen was the old man selling the car after it sat in his backyard for 40 years. Walking way from that was very difficult.",
      "time": 1648827265,
      "type": "comment"
    }
  ],
  "Bud": [
    {
      "by": "Bud",
      "id": 30878857,
      "parent": 30878489,
      "text": "Hilarious, and also such a fun tour of the quirks of this old car.",
      "time": 1648825634,
      "type": "comment"
    }
  ],
  "roydivision": [
    {
      "by": "roydivision",
      "id": 30881118,
      "parent": 30878489,
      "text": "Wonderful piece of writing, thanks Norman Garrett.",
      "time": 1648835445,
      "type": "comment"
    }
  ],
  "civilized": [
    {
      "by": "civilized",
      "id": 30883281,
      "parent": 30878489,
      "text": "So.... is this car a good car that&#x27;s just way too old, or were Porsches of this vintage not good to begin with?",
      "time": 1648847001,
      "type": "comment"
    }
  ],
  "JPKab": [
    {
      "by": "JPKab",
      "id": 30882190,
      "parent": 30878489,
      "text": "The car has a manual transmission.<p>The odds of a car thief in 2022 in a modern American city being old enough to be in the age cohort that knows how to drive stick are minimal.",
      "time": 1648840573,
      "type": "comment"
    }
  ],
  "mdoms": [
    {
      "by": "mdoms",
      "id": 30881374,
      "parent": 30878489,
      "text": "Hagerty is about the only automotive journalism left that&#x27;s worth reading and I am so grateful they are still around (and still improving at a clip). I you have even a cursory interest in cars their Youtube channel is excellent. Jason Cammisa joined then Hagerty team last year and is now producing the absolute best car content on the web.<p>I doubt anyone from Hagerty is reading this but genuinely thank you for making the car content you do. Automotive journalism sometimes feels like a dying industry but you give me hope.",
      "time": 1648836461,
      "type": "comment"
    },
    {
      "by": "mdoms",
      "id": 30881570,
      "parent": 30879912,
      "text": "I have a &#x27;88 Ford Falcon ute which is mercifully easy to fix and parts are plentiful. I absolutely recommend old cars to everyone, as mentioned elsewhere in this thread they build character. But I mostly recommend the ones with lots of parts. Not just factory but cars that had a strong aftermarket in their day.",
      "time": 1648837297,
      "type": "comment"
    },
    {
      "by": "mdoms",
      "id": 30881591,
      "parent": 30880986,
      "text": "I read your first sentence and was about to regale you with the reliability stories of my 2009 BMW 335i, but I see you have that covered in your second sentence. I mercifully sold that car just a few weeks ago and it&#x27;s like having a weight off my back not seeing it in the driveway every day.",
      "time": 1648837418,
      "type": "comment"
    },
    {
      "by": "mdoms",
      "id": 30881634,
      "parent": 30879280,
      "text": "It troubles you that this person has an interest you don&#x27;t share?",
      "time": 1648837584,
      "type": "comment"
    },
    {
      "by": "mdoms",
      "id": 30881663,
      "parent": 30879131,
      "text": "No, this is automotive journalism from a company that also sells automotive insurance. They are an excellent automotive journalism outfit. If you had any actual interest in cars you would know this. If you don&#x27;t - maybe move on and read something else.",
      "time": 1648837719,
      "type": "comment"
    }
  ],
  "AdrianB1": [
    {
      "by": "AdrianB1",
      "id": 30881144,
      "parent": 30878489,
      "text": "20 years ago I lived in an area considered not very safe; the guy in the apartment below was a cop and thieves broke into his car twice and in his house once. I had an older car, so I always left it unlocked, including the trunk: no problem. I also had a motorcycle that I left with the key in the ignition a few times, so various neighbors brought me the key a few times until they learned to leave it there. These were probably the only vehicles in the entire block of flats that were not touched by thieves - maybe they checked the trunk of the car a few times, found nothing interesting and left. The car was not worth stealing, the bike was not easy to ride.",
      "time": 1648835556,
      "type": "comment"
    }
  ],
  "mberning": [
    {
      "by": "mberning",
      "id": 30879673,
      "parent": 30878489,
      "text": "A pathological obsession with objectively terrible machines seems to be a very common character trait.",
      "time": 1648829126,
      "type": "comment"
    }
  ],
  "a_simple_dev": [
    {
      "by": "a_simple_dev",
      "id": 30881789,
      "parent": 30878489,
      "text": "very Zen and the Art of Motorcycle Maintenance. Loved it.",
      "time": 1648838383,
      "type": "comment"
    }
  ],
  "paulpauper": [
    {
      "by": "paulpauper",
      "id": 30881736,
      "parent": 30878489,
      "text": "Just put it on a flatbed lol",
      "time": 1648838123,
      "type": "comment"
    }
  ],
  "ninly": [
    {
      "by": "ninly",
      "id": 30879898,
      "parent": 30878489,
      "text": "Got it. Now, where is the car?",
      "time": 1648830059,
      "type": "comment"
    }
  ],
  "unnouinceput": [
    {
      "by": "unnouinceput",
      "id": 30883153,
      "parent": 30878489,
      "text": "&quot;Thank you for all the tips, but they won&#x27;t be necessary. I&#x27;ll just come with my tow truck, and get it up and I&#x27;m gone in 60 seconds. This vintage gem will fetch a great price once restored properly.<p>Signed, The Thief&quot;",
      "time": 1648846126,
      "type": "comment"
    }
  ],
  "rob_c": [
    {
      "by": "rob_c",
      "id": 30878748,
      "parent": 30878489,
      "text": "story makes me realise why MOTs exist :P sounds like the owner has good fun with that relic, but I wonder is it actually roadworthy?",
      "time": 1648825272,
      "type": "comment"
    }
  ],
  "raverbashing": [
    {
      "by": "raverbashing",
      "id": 30878992,
      "parent": 30878489,
      "text": "Reading this description reminds me why I&#x27;m not a &quot;car person&quot;<p>Several rabbit-holes in Linux have tested my patience less than that",
      "time": 1648826195,
      "type": "comment"
    }
  ],
  "throwaway0a5e": [
    {
      "by": "throwaway0a5e",
      "id": 30878694,
      "parent": 30878489,
      "text": "He could write pretty much the same article about owning an OG Chrysler minivan, which is arguably a more historically significant vehicle but built by a make that prompts sneers about reliability and credit scores from most here, and it would just be considered trashy or prompt pearl clutching by most of the readership.<p>Amazing the breadth of preconceived notions that can be leveraged with a badge on a grill.  Having the presence of mind and ability to leverage readership demographics like this is what really separates good writers and editors from the mediocre.",
      "time": 1648825085,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30879226,
      "parent": 30879102,
      "text": "Depth of knowledge is impossible to assess for anyone that doesn&#x27;t have similar depth in the same subject matter.<p>The author could be bullshitting (he&#x27;s not) but how would anyone who&#x27;s not driven vehicles that are decades beyond their design life know?",
      "time": 1648827193,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30879279,
      "parent": 30878928,
      "text": "When it comes to bad things that happen on the road mechanical condition is a rounding error compared to things people knew were risky and did anyway.  I see no reason we should invest more than a token amount of societal effort chasing the long tail like that.<p>The fact that you start your comment with &quot;in the US&quot; when anyone even slightly familiar with the place knows that pretty much everything about it is a state by state deal is a massive red flag for a comment that serves no purpose but to convert pearl clutching into internet virtue points.  The fact that you end your comment with a back handed quip deriding some imagined notion of freedom more or less confirms it.",
      "time": 1648827445,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30879405,
      "parent": 30879255,
      "text": "Patterns like those are really, really really common on truck transmissions.<p>One rail is 1st&#x2F;reverse.  Another rail is 2nd&#x2F;3rd and the last rail is 4th or OD and direct.  Whether the &quot;fore is a lower gear than aft&quot; holds between the 2nd and 3rd rails is a function of whether or not it&#x27;s a the pair of gears that constitute &quot;forward gear on the right rail) will either be greater or less than 1:1 depending on if it&#x27;s an overdrive transmission whereas the rear position on the right rail will always be direct for reasons that boil down to &quot;that&#x27;s the sensible way to build it&quot;.<p>There&#x27;s not much to &quot;figure out&quot; when you have a direct lever that goes into the shifter.",
      "time": 1648827933,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30881587,
      "parent": 30879438,
      "text": "Beyond 30yr the people driving them are doing it for fun and aren&#x27;t going to generally be running bald tires down the highway in the rain and when they do they are doing it full well knowing that they have to be super careful.  Basically they know what they&#x27;re getting into and don&#x27;t need the state to tell them why working lights are good and brake pads shouldn&#x27;t make metal noises.",
      "time": 1648837366,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30879054,
      "parent": 30878908,
      "text": "I think most people here would be fawning over the article were it a Toyota Previa or some other car that does not bring to mind &quot;transportation that a day laborer would have driven circa &lt;10-15yr after its model year&gt;&quot; which is what happens to a lot of successful vehicles.",
      "time": 1648826464,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30884902,
      "parent": 30880284,
      "text": "How fast do you need to go?  Hyster, Crown, et. al. make what you want.",
      "time": 1648860993,
      "type": "comment"
    },
    {
      "by": "throwaway0a5e",
      "id": 30881337,
      "parent": 30880104,
      "text": "&gt;I&#x27;m convinced the whole thing is a make-work program that&#x27;s holding our air quality hostage. (And I&#x27;m strongly for tightening emissions standards!)<p>My state on the other coast does (or used to) openly admit in the official training slides for the inspection license that the reason they have safety inspections is so that holding a state inspection license (they do a single license that covers both emissions and safety) is lucrative and therefore license holders have a financial incentive not to fudge emissions inspections.<p>Pretty much every business who is supplied a customer base by force of law gives the quality of service you describe.",
      "time": 1648836325,
      "type": "comment"
    }
  ],
  "herodotus": [
    {
      "by": "herodotus",
      "id": 30878538,
      "parent": 30878489,
      "text": "Brilliant!",
      "time": 1648824271,
      "type": "comment"
    }
  ],
  "avgcorrection": [
    {
      "by": "avgcorrection",
      "id": 30879131,
      "parent": 30878489,
      "text": "This is an ad for “Insurance for people who love cars” (Hagerty).",
      "time": 1648826833,
      "type": "comment"
    },
    {
      "by": "avgcorrection",
      "id": 30886169,
      "parent": 30881663,
      "text": "Am I not allowed to read a piece on something which I am not sufficiently interested in? Like I guess many others, the “how to steal my car” (implying that it would be arduous) piqued my interest. Even though I am not interested in cars.",
      "time": 1648879595,
      "type": "comment"
    }
  ],
  "itomato": [
    {
      "by": "itomato",
      "id": 30882007,
      "parent": 30878489,
      "text": "Haha, joke&#x27;s on you.<p>As a reformed air-cooled VW enthusiast, these are my natural driving tendencies.",
      "time": 1648839528,
      "type": "comment"
    }
  ],
  "ho_schi": [
    {
      "by": "ho_schi",
      "id": 30879828,
      "parent": 30878489,
      "text": "It always entertaining when Americans speaking about manual transmissions as something mysterious. It is not, feet on pedal, switch, feet from pedal. Europeans are surprised seeing you manipulating the wipers to control the transmission.<p>I consider personally most automatic transmissions horrible. The gear is either to high to overtake or so low that the engine is running with too much RPM. The only exception is the gear-less Multitronic[1] by Audi. Sadly replaced by DSG. Nasty rumors say VW did that because the Multitronic had no more issues and worked well ;)<p>The DSG works somehow and the shifting is somehow acceptable. The automatic transmission Ford uses (e.g. C-Max) is horror for the driver, passengers and the engine. Adventurous people may proceed to double-clutching[2].<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Multitronic\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Multitronic</a><p>[2] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Double_clutch_(technique)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Double_clutch_(technique)</a>",
      "time": 1648829783,
      "type": "comment"
    },
    {
      "by": "ho_schi",
      "id": 30880114,
      "parent": 30879946,
      "text": "ZF8 seems to be used by Audi only for cars sold in America?<p>btw. \nZF means Zahnradfabrik Friedrichshafen. Which is owned by the Zeppelin Foundation. Which was founded to support the built of Zeppelin Luftschiffe and social purposes. Weird story. And the Zeppelin Foundation was for a long time owner of Cherry. The company behind most mechanical keyboard switches. They should&#x27;ve kept that, growing business area - mechanical switches ;)",
      "time": 1648830945,
      "type": "comment"
    },
    {
      "by": "ho_schi",
      "id": 30880200,
      "parent": 30880089,
      "text": "Sorry my friend.    \nI&#x27;m preferring gasoline ;)",
      "time": 1648831234,
      "type": "comment"
    }
  ],
  "Eric_WVGG": [
    {
      "by": "Eric_WVGG",
      "id": 30879441,
      "parent": 30878755,
      "text": "My father had one of these just sort of gathering dust in the garage when I was growing up, utterly shocked when I turned 16 and he handed me the keys.<p>I still like to casually drop &quot;oh yeah, I used to have a Porsche back when I was 16.&quot; Although I must say it was in immeasurably better shape than this one :D<p>I still dream of finding an old 914 and giving it an electric conversion… I&#x27;d have to do something about that rear window, though, it whips air forward when you drive with the top down.",
      "time": 1648828061,
      "type": "comment"
    },
    {
      "by": "Eric_WVGG",
      "id": 30886495,
      "parent": 30883591,
      "text": "back when I was a teenager, I read a few bits that referred to it as a “VoPo”",
      "time": 1648884800,
      "type": "comment"
    }
  ],
  "titzer": [
    {
      "by": "titzer",
      "id": 30881086,
      "parent": 30878755,
      "text": "lol, your memory jogged my memory of me and my neighbor, me 14, he 16, finding an almost-completely disassembled moped in the woods behind my house. It had been completely stripped--out of spite, it would appear, since everything not firmly attached to the steel frame, including all of the plastic shell parts, lights, switches, etc, had been strewn all around. Of the few things attached to the frame, it was lucky the engine, gas tank, and rear wheel, remained. We lugged this 200+ pound pile of junk a few hundred yards through the woods into my garage. Just replaced the spark plug cable, and it fricking started up! We then proceeded to replace the front wheel with a BMX bike tire, fashioned a makeshift seat out of a banana bicycle seat with some angle-iron, and <i>I rode that heap of junk, wires flailing off the frame, for over a year.</i> I got pulled over by the police for not having lights. Problem was, in the mess of wiring that <i>did</i> exist, I was randomly splicing into whatever, including a feed that apparently hadn&#x27;t gone through a voltage regular, and would burn out the tail lights if I hit the brakes at too high of an RPM. After the police incident, my dad wouldn&#x27;t let me ride it on the street anymore, and then eventually he took it to the junk yard one day when I was at school.",
      "time": 1648835268,
      "type": "comment"
    }
  ],
  "evanjacobs": [
    {
      "by": "evanjacobs",
      "id": 30880601,
      "parent": 30878755,
      "text": "My first car was also a 914 that the father of a friend of mine had sitting in his garage. The transmission was shot (no first gear) and the suspension had given out but I bought it anyway for $800 and put about $2000 into fixing it.<p>It was a really fun car to drive although it also shared many of the same quirks as mentioned in this story.",
      "time": 1648832987,
      "type": "comment"
    }
  ],
  "theluketaylor": [
    {
      "by": "theluketaylor",
      "id": 30880366,
      "parent": 30879102,
      "text": "On the flip side, I know a ton about cars and actually own a german sports car of roughly this vintage and this rings incredibly true (and also hilarious). My car can&#x27;t be locked due to fear of it never opening again, starting the engine requires a delicate balance of the right amount of throttle and prayers the battery has enough charge, and selecting first is a preposterous mixture of a delicate ballet and sledgehammering it home.<p>The fact this essay works for someone with limited domain knowledge and someone with lots is a testament to the quality of writing.",
      "time": 1648831865,
      "type": "comment"
    },
    {
      "by": "theluketaylor",
      "id": 30880418,
      "parent": 30879348,
      "text": "Reverse lockouts came around in the 80s or so, so his 914 wouldn&#x27;t have one. On older transmissions you&#x27;re free to try to ram it into reverse at 100 kph if you really want to try.",
      "time": 1648832130,
      "type": "comment"
    },
    {
      "by": "theluketaylor",
      "id": 30880541,
      "parent": 30879197,
      "text": "In this case a 914 is close to the perfect car for autocross. They are super light, so they change direction like a fly. The mid engine layout means they have excellent balance. Autocross is a low speed event, so the lack of power isn&#x27;t the penalty it would be on a larger circuit. With modern tires a 914 should do extremely well.",
      "time": 1648832642,
      "type": "comment"
    },
    {
      "by": "theluketaylor",
      "id": 30881741,
      "parent": 30881442,
      "text": "The locks are stupidly expensive, like $1000 a door. I&#x27;d rather just not lock it. The starting issues are due to the carb needing a rebuild. It&#x27;s on my list, but there are bigger fish to fry. The battery is due to it being a former race car with a tiny, super light battery. It&#x27;s only designed to crank the engine a few times before it&#x27;s dead to save weight. 1st gear in non-syncro, so it&#x27;s for sure not that. It&#x27;s likely the linkage, but that&#x27;s a big job and won&#x27;t be worth doing for a few years along with a few other things at the same time.<p>It&#x27;s a cheap vintage car that isn&#x27;t worth spending any real money on. I could pour $40,000 into getting into concours shape, but it would only add 2-3 grand worth of value. Instead I drive and enjoy it.",
      "time": 1648838138,
      "type": "comment"
    },
    {
      "by": "theluketaylor",
      "id": 30880641,
      "parent": 30880114,
      "text": "The ZF8 is in plenty of euro Audis as well, but only the big, expensive stuff since it&#x27;s a longitudinal gearbox. The more common, smaller Audis would be on the MQB transverse platform that can&#x27;t use the ZF8. And Audi has been using a dual clutch on some of their lower-end MLB cars.<p>Anything A6&#x2F;Q7 and up is a ZF8 if it&#x27;s an automatic.",
      "time": 1648833181,
      "type": "comment"
    }
  ],
  "Semaphor": [
    {
      "by": "Semaphor",
      "id": 30879424,
      "parent": 30879102,
      "text": "&gt;  I have absolutely no clue what this person is talking about and have no interest in cars, yet I read every single word.<p>I was about to write more or less the same thing. I can barely drive and never owned a car, but this article was beautiful.",
      "time": 1648827999,
      "type": "comment"
    }
  ],
  "skeeter2020": [
    {
      "by": "skeeter2020",
      "id": 30879699,
      "parent": 30879102,
      "text": "If you love this style and want something intentionally ridiculous check out the various writings at <a href=\"https:&#x2F;&#x2F;www.mcsweeneys.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mcsweeneys.net&#x2F;</a>",
      "time": 1648829214,
      "type": "comment"
    }
  ],
  "oh_sigh": [
    {
      "by": "oh_sigh",
      "id": 30885926,
      "parent": 30879102,
      "text": "No one mentioned yet I think, but it makes sense he has this deep passion about a car. From his bio:<p>&gt; Norman Garrett was the Concept Engineer for the original Miata back in his days at Mazda’s Southern California Design Studio",
      "time": 1648875439,
      "type": "comment"
    }
  ],
  "rootsudo": [
    {
      "by": "rootsudo",
      "id": 30880219,
      "parent": 30879102,
      "text": "It&#x27;s quite fun, but anyone can pick it up in a few days if you join a few great Car forums that remain, or, ick, facebook groups and reddit groups. The discord groups are more of casual conversation and making fun of each other&#x2F;new people who are trying to DIY.<p>The BMW car forum is good, bimmerforums.com. \nPelicanpart forum is good. BMW&#x2F;Porsche\nGrassrootMotorsports is good. General racing, falls back to bmw&#x2F;porsche&#x2F;corvette&#x2F;mazda\nMiata.net is fantastic. \nCorvette forums are great, but I can&#x27;t recall them now. \nSubaru Forum is fantastic, humour though is needed. NASIOC.com\npriuschat is great, though it goes quite different from above forums. \nTesla forums are good, but I can&#x27;t recall any off the top of my hand. \nAnd then landcruiser ones, wrangler&#x2F;jeep ones, etc.<p>The more less hobby a car is, the decrease in quality in forum posts, not that a corolla is a bad car per se, or even a camry&#x2F;accord. It&#x27;s just, different folks for different hobbies.<p>Spend a week on there, and you&#x27;ll learn the lingo (it&#x27;s universal throughout cars, especially per car generation&#x2F;period, 70&#x27;s&#x2F;80&#x27;s&#x2F;90&#x27;s,etc)<p>Then you also have other motorsports too, motorcycles and even planes, which share the same sentiment. Pilot chat&#x2F;bicker is very similar. ;)",
      "time": 1648831295,
      "type": "comment"
    }
  ],
  "DonHopkins": [
    {
      "by": "DonHopkins",
      "id": 30879462,
      "parent": 30879336,
      "text": "Reminds me of the time at Sun when I tried to use XBugTool to report a bug against itself, and it got extremely angry at me, and trapped my input focus in the bug description text editor, where I vented my frustration.<p><a href=\"http:&#x2F;&#x2F;www.art.net&#x2F;~hopkins&#x2F;Don&#x2F;unix-haters&#x2F;x-windows&#x2F;xbugtool.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.art.net&#x2F;~hopkins&#x2F;Don&#x2F;unix-haters&#x2F;x-windows&#x2F;xbugto...</a>",
      "time": 1648828203,
      "type": "comment"
    }
  ],
  "jiggawatts": [
    {
      "by": "jiggawatts",
      "id": 30884794,
      "parent": 30879336,
      "text": "I once took out the internal telephony network of a large bank&#x27;s head office through simply scanning the network for devices. They weren&#x27;t tracking IP addresses (or anything) in any form of database or even a spreadsheet, and I was tasked with finding and updating every device on a particular network. I used nmap and simply did a subnet scan to find anything that would respond on common ports.<p>It all went down in a heap and I felt very guilty for a few minutes until I realised that this infrastructure was so fantastically unstable that a TCP half-open (just a SYN packet!) could kill it stone dead. That&#x27;s not <i>my</i> fault.<p>You can&#x27;t blame the postman if knocking on the front door demolishes your building.",
      "time": 1648859794,
      "type": "comment"
    }
  ],
  "Sohcahtoa82": [
    {
      "by": "Sohcahtoa82",
      "id": 30880693,
      "parent": 30879336,
      "text": "At a previous job, I had to do a penetration test on a platform, and I had the same thing.  Any SQL errors would just crash the back end entirely and I&#x27;d have to wait for them to bring it back up manually, which could take a long time since I was on the US West coast and they were based in the UK.<p>Among all the other security issues they had (easily gained a root shell via template injection, multiple XSS issues, CSRF, basically everything in the OWASP Top 10), to call their security posture Swiss cheese would be an understatement.<p>A couple months after my test, the entire project was scrapped.",
      "time": 1648833490,
      "type": "comment"
    },
    {
      "by": "Sohcahtoa82",
      "id": 30880719,
      "parent": 30880473,
      "text": "Miata stands for &quot;Miata Is Always The Answer&quot;<p>Reliable, fun, and economical.  The only thing they lack is practicality, being a two-seater with a small trunk.  But if you don&#x27;t have to worry about carrying kids or cargo, they&#x27;re great cars!",
      "time": 1648833605,
      "type": "comment"
    }
  ],
  "remram": [
    {
      "by": "remram",
      "id": 30883982,
      "parent": 30879336,
      "text": "I feel like there&#x27;s an analogue to the CAP theorem for code, where you can have an un-exploitable application if you don&#x27;t need it to keep running in the presence of unusual requests.<p>Secure, Available, Unattended, choose any 2? You can have a secure&amp;available app but you need to keep patching it. You can have an available&amp;unattended app but it won&#x27;t be secure. Or you can have a secure&amp;unattended app, it will just need to crash a lot.",
      "time": 1648852268,
      "type": "comment"
    }
  ],
  "JasonFruit": [
    {
      "by": "JasonFruit",
      "id": 30880120,
      "parent": 30879336,
      "text": "The application denies access to intruders by successfully ceasing to function.",
      "time": 1648830962,
      "type": "comment"
    }
  ],
  "winrid": [
    {
      "by": "winrid",
      "id": 30881585,
      "parent": 30881375,
      "text": "I had to diagnose an issue with said brain on a car from 1982.<p>Previous owners could not figure out the issue. The car&#x27;s engine would rev &quot;bounce&quot; at idle like it had a big cam, but it didn&#x27;t go away when driving, making driving not very fun. So I got the Scirocco for dirt cheap.<p>I realized on day that if you opened and closed the hood a couple times, the issue would fix it self, and it was very repeatable.<p>I realized the computer is mounted next to the hood hinge!<p>I got lucky and just blindly resoldering all the joints in the computer fixed it.<p>We later swapped that 400k mile motor setup to a modern turbo motor with a sequential gearbox, and it&#x27;s a rally car now. :)<p>(not super important to story but the &quot;ECU&quot; from 1982 was a bit more modern, Jetronic as it was called was &quot;only&quot; roughly the size of a few old TI-82s).",
      "time": 1648837362,
      "type": "comment"
    }
  ],
  "StillBored": [
    {
      "by": "StillBored",
      "id": 30881825,
      "parent": 30881375,
      "text": "I think EFI overstates it a bit, while I guess true compared with the mechanical fuel injection, it was an entirely analog system.<p><a href=\"https:&#x2F;&#x2F;bowlsby.net&#x2F;914&#x2F;Classic&#x2F;zTN_Man06.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;bowlsby.net&#x2F;914&#x2F;Classic&#x2F;zTN_Man06.pdf</a>",
      "time": 1648838584,
      "type": "comment"
    },
    {
      "by": "StillBored",
      "id": 30881885,
      "parent": 30880568,
      "text": "I think part of the fun of 914&#x27;s is how raw they are. Once you get all the individual car&#x27;s eccentricities down its the same fun, but you feel like its all your secret on the good days when the car is working as intended.<p>The fact that they are dog slow is made up by the fact that your sitting on this little motor making a huge racket. Its the &quot;I must be going fast, given how much noise i&#x27;m hearing&quot; thing.",
      "time": 1648838870,
      "type": "comment"
    },
    {
      "by": "StillBored",
      "id": 30881925,
      "parent": 30880713,
      "text": "After you have hand built a new battery that fits it, built a LCD shim to connect to whatever the latest standard is, etc.<p>Older cars are simpler, both in total, as in the requirements to retrofit replacement parts. Your average machine shop&#x2F;etc will be able to keep that 914 running for the next hundred years. And when they stop selling gas, you can convert it to run on everclear.",
      "time": 1648839089,
      "type": "comment"
    }
  ],
  "adingus": [
    {
      "by": "adingus",
      "id": 30884094,
      "parent": 30881375,
      "text": "The VW EFI actually works really well when it works! Late 70s VW buses and bugs are some of the nicest to drive around in because of the EFI.",
      "time": 1648853270,
      "type": "comment"
    }
  ],
  "bombcar": [
    {
      "by": "bombcar",
      "id": 30879255,
      "parent": 30878953,
      "text": "The Deuce and a Half has an even more interesting one, just when you think you&#x27;ve figured out the dog-leg you find the last two are reversed again.<p>HN supports shift pattern unicode!<p>Ⓡ②⑤<p>|–|–|<p>①③④",
      "time": 1648827346,
      "type": "comment"
    },
    {
      "by": "bombcar",
      "id": 30879294,
      "parent": 30879069,
      "text": "I had a car where the shifter broke to the automatic transmission - it was simple enough to bypass the neutral safety switch and then I could just leave it in Drive all the time. Just had to make sure if parking to park on an incline if I wanted to be able to roll back out of the parking space.<p>Eventually I cut a hole in the floor and welded a shifter direct to the transmission.",
      "time": 1648827484,
      "type": "comment"
    },
    {
      "by": "bombcar",
      "id": 30879337,
      "parent": 30878826,
      "text": "Ⓡ②⑤<p>|–|–|<p>①③④<p>Huh HN lets me approximate the shift pattern of a deuce.5",
      "time": 1648827625,
      "type": "comment"
    },
    {
      "by": "bombcar",
      "id": 30881670,
      "parent": 30880309,
      "text": "Fun fact: the torque converter was invented a few years <i>before</i> the automatic transmission - and some cars were sold with a manual transmission and a torque converter. With only two or three forward gears, they found most of the customers would leave the car in the top gear and just accelerate slowly ...",
      "time": 1648837758,
      "type": "comment"
    },
    {
      "by": "bombcar",
      "id": 30879609,
      "parent": 30879405,
      "text": "Exactly, the more the device can assume the <i>operator</i> is trained the simpler it is - so truck transmissions are closer to the &quot;Platonic Transmission Form&quot; if you will than fancy car transmissions.<p>The Deuce doesn&#x27;t even have synchronizers, you&#x27;re expected to double clutch and handle that part yourself.",
      "time": 1648828850,
      "type": "comment"
    },
    {
      "by": "bombcar",
      "id": 30879580,
      "parent": 30879400,
      "text": "Old cars had an accessible amount of &quot;troubleshooting&quot; available which greatly helps learn tinkering skills.<p>New cars are substantially more reliable, but that same troubleshooting can be helpful but somewhat harder to learn I feel.",
      "time": 1648828711,
      "type": "comment"
    },
    {
      "by": "bombcar",
      "id": 30881655,
      "parent": 30879779,
      "text": "Half the troubleshooting is being able to recognize and describe the problem in such a way that you can search for the solution. Knowing what &quot;sluggish acceleration&quot; is vs &quot;RPM limited at 3k&quot; vs &quot;cold-start no power&quot; is half the battle.<p>YouTube <i>is</i> substantially better than the old Chilton manuals and arguably some better than the manufacturer repair manuals (many of which assume you have an entire dealer shop&#x27;s worth of tools). A number of videos (and even some of the Chilton manuals) will have variations on the process that either avoid the specialized tool (at perhaps a bit longer of a process) or a workaround that greatly simplifies the process.",
      "time": 1648837673,
      "type": "comment"
    }
  ],
  "technofiend": [
    {
      "by": "technofiend",
      "id": 30879552,
      "parent": 30878953,
      "text": "&gt; and then rapidly wig-wag the shift knob side-to-side along a lateral axis.<p>I learned this driving my first car which was a similar vintage Karmann Ghia.  It still did it out of habit twenty years later driving my stick-shift Jetta. The second YouTube video I found of someone learning to drive a KG was doing it instinctively as well. [1]  I guess there&#x27;s so much play you just learn to wig-wag a little to see if you&#x27;re in gear or not.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=WF77y8IVi8k\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=WF77y8IVi8k</a>",
      "time": 1648828569,
      "type": "comment"
    },
    {
      "by": "technofiend",
      "id": 30879642,
      "parent": 30878963,
      "text": "Imagine my surprise when this year my 1996 Toyota was suddenly an &quot;antique&quot; by state law. Yearly inspection for antique cars is a safety check as you described - does it have working windshield wipers, lights and seat belts, but no longer any emissions check.",
      "time": 1648828989,
      "type": "comment"
    }
  ],
  "optymizer": [
    {
      "by": "optymizer",
      "id": 30879348,
      "parent": 30878953,
      "text": "What a blast from the past. I learnt to drive using a VW Golf, and I&#x27;ve always thought this shift pattern is just standard on German cars with manual transmission (at least in the 90s).<p>One thing I don&#x27;t see mentioned is that you first have to press down onto the knob, then shift forward, in order to shift the transmission into R. Simply pushing the knob forward won&#x27;t go from N to R.",
      "time": 1648827665,
      "type": "comment"
    }
  ],
  "fosk": [
    {
      "by": "fosk",
      "id": 30881325,
      "parent": 30878953,
      "text": "It’s a better pattern for racing since you can more easily shift between 2nd and 3rd gear in a quicker way. Older Ferraris (I believe the Testarossa and the TR512, but maybe others too) also have the same pattern.",
      "time": 1648836283,
      "type": "comment"
    }
  ],
  "dugmartin": [
    {
      "by": "dugmartin",
      "id": 30880810,
      "parent": 30878953,
      "text": "That part of the story reminded me of the 1978 MGB I had as a teenager.  If you had <i>just</i> a little leftward pressure on the stick going from 1st to 2nd the gearbox would happily announce &quot;welcome to reverse!&quot;.  The throw between gears was so small I ended up just using my middle finger to push down from 1st to 2nd and 3rd to 4th and then hooking my thumb around the knob to go from 2nd to 3rd.  5th gear was electric - a little switch that seemed to break every few months.",
      "time": 1648834026,
      "type": "comment"
    },
    {
      "by": "dugmartin",
      "id": 30880953,
      "parent": 30880189,
      "text": "I wrote in another comment about my 1978 MGB.  You missed a few more fun parts (they might have just been for my model year though):<p>1. The &quot;springs&quot; under the seats were bent wood slats (my dad and I put in new carpeting and found that one out when we removed the seats).<p>2. The heater was literally sliding a door to the engine way down the foot well.  I remember several winter top down drives in the Midwest where my face and hands were frozen but my legs felt like they were being branded.<p>3. The manual choke.<p>4. The small cascade of water in your face when you drove in the rain and took a corner.<p>5. The electric 5th that seemed to break every few months.<p>All good memories though.",
      "time": 1648834691,
      "type": "comment"
    }
  ],
  "berkes": [
    {
      "by": "berkes",
      "id": 30886414,
      "parent": 30879068,
      "text": "My 83 VW T3 was attempted to be stolen once. But, like the author, my bus leaks some power. So I too installed a switch that just disconnects the battery.<p>It isn&#x27;t hidden or super secret. Just adds extra work and time for someone probably being stressed out already.<p>A friends&#x27; T3 was left in the middle of the road, because her gearbox was broken-ish and finding the reverse a learned skill. Halfway through turning her bus, thieves just gave up. She found her car perpendicular to the road in the morning.",
      "time": 1648883500,
      "type": "comment"
    }
  ],
  "protomyth": [
    {
      "by": "protomyth",
      "id": 30879806,
      "parent": 30879068,
      "text": "<i>It&#x27;s not about being perfect when it comes to car security, it&#x27;s about being too much of a pain in the ass, so they&#x27;ll give up and move on.</i><p>Yeah, my Dad had a Ford F-100 that had a gear shift that would come out.  He drove it to work and took the gear shift inside and left it in his locker.  Not the best location (a town in Oregon in the 70&#x27;s), but he never had any trouble with someone stealing his ride out of the parking lot.  I still remember the sound of the gas sloshing in the tank behind the seat.",
      "time": 1648829699,
      "type": "comment"
    },
    {
      "by": "protomyth",
      "id": 30879839,
      "parent": 30879512,
      "text": "I&#x27;m not so sure on that.  Some of the states that don&#x27;t test are pretty damn inhospitable to cars and bad emissions is often the first sign of the end of the vehicle.",
      "time": 1648829840,
      "type": "comment"
    }
  ],
  "jihadjihad": [
    {
      "by": "jihadjihad",
      "id": 30879073,
      "parent": 30878751,
      "text": "Wow, what a blast from the past. My first car was a 1990 Mercury Grand Marquis, and it developed this same solenoid issue. My grandpa taught me that same trick of shorting past the solenoid so that the car can start. My friends were always very curious why there was a hammer underneath the passenger&#x27;s seat, at least until I told them to hand it to me and crank the engine when I gave the shout.",
      "time": 1648826545,
      "type": "comment"
    }
  ],
  "pmags": [
    {
      "by": "pmags",
      "id": 30880845,
      "parent": 30878751,
      "text": "I had a &#x27;73 VW Bug -- the solenoid failed in the middle of a post-college beach camping adventure through Baja with a friend.  We too designated a screwdriver just for this purpose and kept track of whose turn it was to slide under the car to short the terminals. We became quite adept at it! Good times...",
      "time": 1648834226,
      "type": "comment"
    }
  ],
  "agloeregrets": [
    {
      "by": "agloeregrets",
      "id": 30880562,
      "parent": 30880473,
      "text": "Seriously, same thought. The Miata is this but without anything after the first paragraph. It starts and runs instantly, is fuel injected, brakes well, and the transmission is notably direct feeling. It is the feeling of a good day in the 914 every day (and thus worse, because you do not know the bad days). I guess this guy went though hell to define such a great car.",
      "time": 1648832751,
      "type": "comment"
    },
    {
      "by": "agloeregrets",
      "id": 30880568,
      "parent": 30878967,
      "text": "The irony being that the Miata is none of this. Notably reliable and easy to drive.",
      "time": 1648832788,
      "type": "comment"
    }
  ],
  "noduerme": [
    {
      "by": "noduerme",
      "id": 30882659,
      "parent": 30880473,
      "text": "Miatas are great, but I think the Fiat version is even more fun.",
      "time": 1648843232,
      "type": "comment"
    }
  ],
  "giarc": [
    {
      "by": "giarc",
      "id": 30879197,
      "parent": 30878742,
      "text": "It&#x27;s not always the dog in the fight, but the fight in the dog.<p>I knew a guy that was an incredible mountain biker, won all the races he entered etc. He used to show up with crappy bikes probably 10lbs heavier than everyone else... he&#x27;d still win. Sometimes you either have it or you don&#x27;t, and all the equipment in the world won&#x27;t help you.",
      "time": 1648827081,
      "type": "comment"
    }
  ],
  "Corrado": [
    {
      "by": "Corrado",
      "id": 30885561,
      "parent": 30878742,
      "text": "We had a guy in some Ford station wagon that would win all the time.  The smoothest driving I&#x27;ve ever seen; I don&#x27;t think the tires even made a noise.",
      "time": 1648869055,
      "type": "comment"
    },
    {
      "by": "Corrado",
      "id": 30885580,
      "parent": 30880827,
      "text": "Oh my Dad&#x27;s old Chevy stepside was a bear to drive.  That 3-on-the-tree gave me fits.  On the upside, I can drive just about any car on Earth now without too much trouble.",
      "time": 1648869460,
      "type": "comment"
    },
    {
      "by": "Corrado",
      "id": 30885570,
      "parent": 30883870,
      "text": "Yea, I drove my 914 for 3-4 years before selling it.  I didn&#x27;t remember having trouble shifting until I read the article and your response here, then it all came flooding back.  Those first couple of weeks were &quot;exciting&quot; but after that it just became a normal part of driving the car.  No wonder nobody wanted to drive my car.",
      "time": 1648869211,
      "type": "comment"
    },
    {
      "by": "Corrado",
      "id": 30885552,
      "parent": 30880541,
      "text": "I autocrossed my &#x27;71 914&#x2F;4 and it was so much fun.  Somewhere I have a picture of me 3 wheeling it around a corner.",
      "time": 1648868937,
      "type": "comment"
    }
  ],
  "jeffbee": [
    {
      "by": "jeffbee",
      "id": 30879232,
      "parent": 30878742,
      "text": "That’s a funny sport. For years the SF area events were dominated by a guy who ran a ‘78 Toyota Corolla hatchback. Or what had once been that car, anyway.",
      "time": 1648827217,
      "type": "comment"
    }
  ],
  "kQq9oHeAz6wLLS": [
    {
      "by": "kQq9oHeAz6wLLS",
      "id": 30884159,
      "parent": 30878907,
      "text": "My friend in high school had a Mercury Capri like that. Dad was a drag racer, so that thing could beat anything up to 75mph. Then it&#x27;d rattle itself to bits.<p>Left my MGB in the dust, of course",
      "time": 1648853874,
      "type": "comment"
    },
    {
      "by": "kQq9oHeAz6wLLS",
      "id": 30884099,
      "parent": 30883870,
      "text": "Not terribly odd, either. My 46 Dodge truck has the same shift pattern, albeit with just 3 forward gears.",
      "time": 1648853336,
      "type": "comment"
    },
    {
      "by": "kQq9oHeAz6wLLS",
      "id": 30884142,
      "parent": 30882478,
      "text": "Those are a blast. I took a friend&#x27;s one around a listed 15 mph corner at darn near highway speeds (on warm semi-slick tires) with not near the understeer you&#x27;d expect.",
      "time": 1648853723,
      "type": "comment"
    }
  ],
  "technothrasher": [
    {
      "by": "technothrasher",
      "id": 30882381,
      "parent": 30879808,
      "text": "I&#x27;ve been saying for a while now, there will be no more &#x27;classic cars&#x27; starting after the mid-1990&#x27;s because of the failure of electronic parts that will not be able to be replaced.  The best that will happen is people using the shells to &#x27;restomod&#x27; them into new cars that look old.  Even today, it&#x27;s much easier for a beginner to buy a broken 1970&#x27;s car and get it running than a broken 1990&#x27;s car.",
      "time": 1648841737,
      "type": "comment"
    },
    {
      "by": "technothrasher",
      "id": 30882466,
      "parent": 30880189,
      "text": "You forgot the points based fuel pump that needs a bang or two with a mallet occasionally to keep running.  Not that I will ever admit to owning an MG (or four) since I&#x27;m a Triumph guy at heart.",
      "time": 1648842205,
      "type": "comment"
    },
    {
      "by": "technothrasher",
      "id": 30881508,
      "parent": 30880219,
      "text": "This is all true, but one needs to be aware that these forums are also chock full of &quot;forum folklore&quot;.  You&#x27;ll get all kinds of advice and lecturing which is driven by what has been posted before rather than what matches reality.<p>Mixing DOT-5 brake fluid with DOT-3&#x2F;4 is always a fun one.  Folklore is that it will poison children and kill puppies.  Reality is that they are, by law, compatible and mixing won&#x27;t do anything more than create a fluid with unknown boiling points, but this is true of mixing any two brake fluids (and it is true DOT-5 is not compatible with ABS brake systems, but that&#x27;s a separate point).<p>Pretty much anything to do with turbos is another fun one, as many folks have no idea how turbos work but have lots of opinions on tuning them.<p>Anyway, the point is that the comradery is great on these forums, they&#x27;re a lot of fun, and you can find good info, but don&#x27;t take any info on them as gospel.",
      "time": 1648837048,
      "type": "comment"
    },
    {
      "by": "technothrasher",
      "id": 30881675,
      "parent": 30881325,
      "text": "The Ferrari V6&#x2F;V8 cars from the 206 Dino through the 328 have that pattern, but they switched to a standard shift pattern in the 348.  You can&#x27;t accidentally shift into reverse though, as the metal shift gate has a stop on it.  You have to push down to get past the stop and into reverse.",
      "time": 1648837798,
      "type": "comment"
    },
    {
      "by": "technothrasher",
      "id": 30882419,
      "parent": 30881262,
      "text": "At least if you know how to use a code scanner, newer cars are so much better at telling you what is wrong with them. Though it does take some skill and experience to know the difference between what code(s) tripped and what is actually wrong, as often a code that trips is well downstream of what part has failed.  But it&#x27;s amazing the amount of data you can pull out of a car using an Autel reader or similar.",
      "time": 1648841962,
      "type": "comment"
    },
    {
      "by": "technothrasher",
      "id": 30883583,
      "parent": 30882335,
      "text": "Come on now, the Porsche engine in the 944 is miles better than the Audi one in the 924.  Got rid of all the vibration issues.  Granted the base 944 is a bit slow, but I’ve currently got an ‘86 951 and it’s still a great car today. The weight distribution on it is just perfect. Much more fun to drive and way more reliable than the ‘85 Ferrari 308 that I recently sold.",
      "time": 1648849097,
      "type": "comment"
    }
  ],
  "bshep": [
    {
      "by": "bshep",
      "id": 30879908,
      "parent": 30879808,
      "text": "as a guess it would go something like this:<p>step 1. prepare a usb with files needed to jailbreak the car and be able to connect to your wifi<p>step 2. setup a home network with dns&#x2F;ntp and a reverse engineered tesla server that will authorize the car to work<p>step 3 set date to reasonable values that the car will accept<p>step 4 do some button dances to start the car from the usb<p>…<p>ill leave the rest to your imagination",
      "time": 1648830087,
      "type": "comment"
    }
  ],
  "SixDouble5321": [
    {
      "by": "SixDouble5321",
      "id": 30886737,
      "parent": 30885394,
      "text": "Idk, my manual Honda was stolen after living near Seattle for about a month. Luckily it wasn&#x27;t valuable enough to chop.",
      "time": 1648888451,
      "type": "comment"
    }
  ],
  "js2": [
    {
      "by": "js2",
      "id": 30879375,
      "parent": 30879069,
      "text": "Hah, 68 Camaro here[1]. I had the clutch linkage fail on me once in Miami Beach and managed to drive it all the way home to South Miami w&#x2F;o the clutch. My recollection was that I had to push start it and managed to time all the traffic lights home so I never came to a full stop.<p>I can&#x27;t believe you managed to do that for a month.<p>1. <a href=\"https:&#x2F;&#x2F;ibb.co&#x2F;CMW3SdS\" rel=\"nofollow\">https:&#x2F;&#x2F;ibb.co&#x2F;CMW3SdS</a> (I sold it over a decade ago.)",
      "time": 1648827794,
      "type": "comment"
    },
    {
      "by": "js2",
      "id": 30879438,
      "parent": 30878928,
      "text": "Yes there is, it varies by state. Author is in NC, same as me. There is a state-wide safety inspection but vehicles older than 30 years are exempt:<p><a href=\"https:&#x2F;&#x2F;www.ncdot.gov&#x2F;dmv&#x2F;title-registration&#x2F;emissions-safety&#x2F;Pages&#x2F;safety-inspections.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncdot.gov&#x2F;dmv&#x2F;title-registration&#x2F;emissions-safet...</a><p>There&#x27;s also an emissions inspection that varies by county, but vehicles older than 20 years are exempt.<p><a href=\"https:&#x2F;&#x2F;www.ncdot.gov&#x2F;dmv&#x2F;title-registration&#x2F;emissions-safety&#x2F;Pages&#x2F;emissions-inspections.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ncdot.gov&#x2F;dmv&#x2F;title-registration&#x2F;emissions-safet...</a><p>Does it make any sense to exempt older vehicles that are most likely to fail these inspections? No, of course it doesn&#x27;t.<p>New vehicles within the most recent 3 model years are also exempt.",
      "time": 1648828056,
      "type": "comment"
    },
    {
      "by": "js2",
      "id": 30879779,
      "parent": 30879580,
      "text": "Troubleshooting is a lot harder for a variety of reasons. Things are hidden away under plastic panels, the vehicles have a lot more electronics, and everything is fit into much tighter spaces.<p>Still, between YouTube and enthusiast forums dedicated to whatever model car it is, you can usually do a lot. Typically if something goes wrong on your car, the same thing has gone wrong to a lot of other folks with the same car and someone has posted about it.<p>If you&#x27;re handy enough and have the right tools, an official manufacturer shop repair manual is what you really want. (Chilton is better than nothing, but you really want the manufacturer repair manual.)<p>But... some things are just a pain in the ass w&#x2F;o a lift and the right tools. Find a good independent mechanic for older cars (easier said than done) or just take it to the local dealer for cars still under warranty.",
      "time": 1648829584,
      "type": "comment"
    }
  ],
  "denimboy": [
    {
      "by": "denimboy",
      "id": 30883870,
      "parent": 30883629,
      "text": "914 had a type 4 engine which it shared with the type 2 VW bus.  However the transmission was completely different from the bus.  The 914 had 5 speeds and the bus only had 4.<p>A lot of the article is about &quot;you&#x27;ll never find 2nd&quot; which is in large part to the weird shifting pattern.  Reverse is where first usually is, first is where second usually is and the rest are in a kind of off by one pattern from there.  This was actually considered a feature since supposedly it allows the driver to make the shift from first to second faster.<p>The vagueness of the stick is very true and something every 914 owner can relate to.  Those first couple weeks you spend some time hunting for the right slot.  I went from first to fifth many times before a muscle memory was developed and I didn&#x27;t have to think about it.",
      "time": 1648851352,
      "type": "comment"
    },
    {
      "by": "denimboy",
      "id": 30884431,
      "parent": 30879545,
      "text": "&gt; Smell is the thing that gets me a lot of the time with classic cars too.<p>I had a 1972 Triumph Bonneville which had a &quot;tickler&quot; button on each carb instead of a choke.  That meant to start it up you would press each tickler button until a bit of gas shot out invariably on your hand but also the engine and the sometimes hot exhaust.  Only after this ritual was performed could you jump on the kickstart (no electric start).  So you end up smelling like gas.<p>Q: Why to the British drink warm beer?\nA: Because Lucas makes electrics.",
      "time": 1648856241,
      "type": "comment"
    }
  ],
  "rozap": [
    {
      "by": "rozap",
      "id": 30881534,
      "parent": 30880237,
      "text": "I have a 74. My wife used it to go camping and I guess I didn&#x27;t explain the starting procedure well enough because it was second nature. She ended up having to get a jump after flooding it and killing the battery. Oops.",
      "time": 1648837144,
      "type": "comment"
    }
  ],
  "tclancy": [
    {
      "by": "tclancy",
      "id": 30881040,
      "parent": 30880827,
      "text": "Ha, yeah, with new cars there’s no reason to try to talk things out and reason with them because there’s no sense they are just being stubborn.",
      "time": 1648835032,
      "type": "comment"
    }
  ],
  "Finnucane": [
    {
      "by": "Finnucane",
      "id": 30879065,
      "parent": 30878810,
      "text": "I was gonna say, I took a long road trip in a 1971 VW microbus and this was triggering some memories. Especially the description of finding the gears!",
      "time": 1648826516,
      "type": "comment"
    },
    {
      "by": "Finnucane",
      "id": 30879727,
      "parent": 30879303,
      "text": "Someone new to driving now probably doesn&#x27;t even know what a gear stick is.",
      "time": 1648829352,
      "type": "comment"
    }
  ],
  "warmwaffles": [
    {
      "by": "warmwaffles",
      "id": 30883151,
      "parent": 30878810,
      "text": "Same here, but with a 1972 BMW. My brake vacuum booster never worked so it is like stomping on a rock. On a cold day you had to feather the throttle, clutch, and brake at the same time until it got warm. I live in a warm climate so it&#x27;s been tuned to idle well on a hot Texas summer day.",
      "time": 1648846116,
      "type": "comment"
    },
    {
      "by": "warmwaffles",
      "id": 30883085,
      "parent": 30882830,
      "text": "I&#x27;ve seen some guys just pull the fuse out for the ECU&#x2F;PCM on the vehicle as the anti-theft device. The thief will start to crank and crank but never get it started. It should draw attention to them and they&#x27;ll just grab what they can and leave.",
      "time": 1648845667,
      "type": "comment"
    },
    {
      "by": "warmwaffles",
      "id": 30883116,
      "parent": 30880541,
      "text": "Yea I&#x27;ve seen some pretty sprightly little 90HP cars do autocross really well. Old 2002 BMWs, Porsche 914s, Mini Coopers, and some little Toyota spyders.",
      "time": 1648845866,
      "type": "comment"
    }
  ],
  "probably_wrong": [
    {
      "by": "probably_wrong",
      "id": 30883810,
      "parent": 30883622,
      "text": "I think it&#x27;s a combination of factors: it is technical, it is funny, it is well written, it resonates with anyone who had to deal with &quot;quirky&quot; hardware, car or not (a.k.a. &quot;that PC that only boots if you press and hold CapsLock&quot;), plus the fact that the weekend is almost here.",
      "time": 1648850811,
      "type": "comment"
    }
  ],
  "shakezula": [
    {
      "by": "shakezula",
      "id": 30884741,
      "parent": 30883622,
      "text": "It’s funny you say that cause this screams HN content to me.<p>I’m a long-time project car builder and this post strikes all the chords of a labor of love.<p>Clever content, technical concepts but written in plain english, relishing in the almost hostile user experiences that some engineering can produce. It smacks of everything HN is to me.",
      "time": 1648859250,
      "type": "comment"
    }
  ],
  "fhood": [
    {
      "by": "fhood",
      "id": 30883472,
      "parent": 30882830,
      "text": "No manual option on the mazda3 now. That was the biggest punch in the gut.",
      "time": 1648848328,
      "type": "comment"
    },
    {
      "by": "fhood",
      "id": 30881548,
      "parent": 30881442,
      "text": "Hahaha, even on old muscle cars with good parts availability, and only 4 moving parts in the first place, something is virtually always broken. Keeping a german car of this era functioning is a sisyphean task.",
      "time": 1648837200,
      "type": "comment"
    }
  ],
  "frosted-flakes": [
    {
      "by": "frosted-flakes",
      "id": 30885848,
      "parent": 30878730,
      "text": "The old cars have better or worse aesthetics? Something can&#x27;t have &quot;more&quot; aesthetics, it&#x27;s not quantifiable. That&#x27;s like saying something has more temperature, instead of a higher or lower temperature.",
      "time": 1648873906,
      "type": "comment"
    }
  ],
  "lastofthemojito": [
    {
      "by": "lastofthemojito",
      "id": 30879545,
      "parent": 30879104,
      "text": "Smell is the thing that gets me a lot of the time with classic cars too.<p>I appreciate the design from another era - mechanical simplicity from when folks weren&#x27;t concerned about maximizing efficiency, thin window frames and door pillars that would fare embarrassingly in a modern crash test, etc.  Sure, it doesn&#x27;t fit the standards of today, but that&#x27;s why these older cars are so different - they&#x27;re literally from a different era.<p>Occasionally I&#x27;ll go down an Internet rabbithole and imagine buying a 60s muscle car or series Land Rover or what have you.  But then I&#x27;ll be near a decades-old machine on the street and be overwhelmed by the smell of the exhaust.  I think I must be more sensitive to it than others, but that mostly kills that idea for me.  I guess I could try swapping in a modern, emissions-controlled drivetrain but that&#x27;s a whole &#x27;nother yak to shave.",
      "time": 1648828543,
      "type": "comment"
    }
  ],
  "krallja": [
    {
      "by": "krallja",
      "id": 30878963,
      "parent": 30878928,
      "text": "It depends on the state. Most of the ones that do exist are concerned with things like “do you have seat belts? are there rear view mirrors? do the turn signals work? is the check engine light on?” Classic&#x2F;antique vehicles are also often exempt.",
      "time": 1648826055,
      "type": "comment"
    }
  ],
  "criddell": [
    {
      "by": "criddell",
      "id": 30879717,
      "parent": 30878928,
      "text": "The state of Washington is an interesting case. They had annual inspections and then somebody ran the numbers and found that so few cars were being flagged, that it was an enormous waste of resources. They got rid of their inspection requirement.<p>More programs should be run like that. Set a goal, create a program, then periodically evaluate if the goal is still the same and if the program is effective.",
      "time": 1648829304,
      "type": "comment"
    }
  ],
  "kragen": [
    {
      "by": "kragen",
      "id": 30878826,
      "parent": 30878727,
      "text": "I was thinking exactly the same thing, except<p>① it was &#x27;83, not &#x27;85 (and thus air-cooled);<p>② it was an aftermarket camper van conversion with some slight design issues in the pop top, not a Westfalia;<p>③ after I rebuilt the engine a second time we sold it, so, blessedly, it&#x27;s not mine anymore.  My engine rebuild survived for a couple of years until the new owner drove it in second gear for an hour at highway speeds, overheating the engine to the point where it punched a pushrod through the crankcase.",
      "time": 1648825507,
      "type": "comment"
    },
    {
      "by": "kragen",
      "id": 30879100,
      "parent": 30879044,
      "text": "I don&#x27;t think he destroyed the engine on purpose, if that&#x27;s what you meant.  I did sell it on purpose though.  I rebuilt the engine on purpose too, because without a working engine the market value of the van was scrap metal.",
      "time": 1648826676,
      "type": "comment"
    }
  ],
  "scarecrowbob": [
    {
      "by": "scarecrowbob",
      "id": 30878972,
      "parent": 30878727,
      "text": "Came to write the same comment, except mine was a &#x27;68.",
      "time": 1648826080,
      "type": "comment"
    }
  ],
  "alar44": [
    {
      "by": "alar44",
      "id": 30881262,
      "parent": 30880986,
      "text": "I would say for the most part, that&#x27;s how all cars were up until the 90s. Post 2000 everything is computerized and there&#x27;s not a ton a shade tree mechanic can do beyond swapping out parts.",
      "time": 1648836012,
      "type": "comment"
    }
  ],
  "pnathan": [
    {
      "by": "pnathan",
      "id": 30881652,
      "parent": 30880986,
      "text": "that was my basic impression. I drove an &#x27;89? Izuzu and a &#x27;85? Mitsubishi as my first two cars in the mid &#x27;00s; they were pretty &quot;just works&quot; too, barring some repairs. Nothing this crotchety.<p>I now drive a &#x27;21 Camry and man, it&#x27;s just <i>nice</i>. Things <i>work</i>.  I mean, I don&#x27;t mind pulling things apart, but it&#x27;s like, do I really want to run Gentoo constantly if I don&#x27;t budget 4-6 hours&#x2F;mo to maintain it? (no)",
      "time": 1648837662,
      "type": "comment"
    }
  ],
  "disiplus": [
    {
      "by": "disiplus",
      "id": 30881073,
      "parent": 30880986,
      "text": "i have a subaru that im not sure will start (something is draining the battery), or when it starts that i will have enough oil.",
      "time": 1648835166,
      "type": "comment"
    }
  ],
  "floren": [
    {
      "by": "floren",
      "id": 30879716,
      "parent": 30879280,
      "text": "The LS swap is the equivalent of gutting a classic computer or piece of stereo equipment and jamming in a Raspberry Pi. Occasionally it&#x27;s an improvement, sometimes the original parts were too far gone, but a lot of the time it&#x27;s just lazy vandalism.",
      "time": 1648829303,
      "type": "comment"
    },
    {
      "by": "floren",
      "id": 30879598,
      "parent": 30879073,
      "text": "Kind of wild that both you and GP developed tricks for shorting the solenoid when a replacement solenoid is like $20 and 10 minutes of work. Well, at least for a Mercury Grand Marquis aka the Ford Crown Victoria, I can&#x27;t speak for Superior German Engineering.",
      "time": 1648828807,
      "type": "comment"
    },
    {
      "by": "floren",
      "id": 30879647,
      "parent": 30879303,
      "text": "My 1985 Jeep CJ-7 is similar... I can be rolling down the road in 3rd gear and the gear knob will occasionally start oscillating in a 4-inch circle all on its own.",
      "time": 1648828995,
      "type": "comment"
    }
  ],
  "h2odragon": [
    {
      "by": "h2odragon",
      "id": 30879943,
      "parent": 30879280,
      "text": "I don&#x27;t doubt this person could restore that car to factory perfection or remake it into a modern masterpiece. Thats not what it&#x27;s for tho.<p>The clapped out heap of junk has an integrity, and dignity, worthy of respect. This car should most properly be exhibited on blocks in the front yard, surrounded by tall grass, possibly with a tree beginning to grow out of it somewhere.<p>Between a  trophy and a salute to both the soul of the machine itself and the many people who made it. &quot;Well done thou good and faithful servant&quot;<p>It should be a habitation for dogs.",
      "time": 1648830218,
      "type": "comment"
    },
    {
      "by": "h2odragon",
      "id": 30878977,
      "parent": 30878694,
      "text": "The starting rituals reminded me of my &#x27;77 Olds Cutlass with the junkyard intake and monster carbs and all sorts of other unwise additions to an already crappy and clapped out machine. Only two people could start that car, and what with the bailing wire holding the axles and frame together no one ever wanted to try towing it.",
      "time": 1648826097,
      "type": "comment"
    }
  ],
  "dpedu": [
    {
      "by": "dpedu",
      "id": 30879331,
      "parent": 30878806,
      "text": "Try using archive.org or another one of the various web archive sites.<p><a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220401144722&#x2F;https:&#x2F;&#x2F;www.hagerty.com&#x2F;media&#x2F;advice&#x2F;a-few-things-to-know-before-you-steal-my-914&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220401144722&#x2F;https:&#x2F;&#x2F;www.hager...</a>",
      "time": 1648827602,
      "type": "comment"
    }
  ],
  "jerf": [
    {
      "by": "jerf",
      "id": 30879012,
      "parent": 30878806,
      "text": "A surprisingly apt error, really, given the article.",
      "time": 1648826275,
      "type": "comment"
    }
  ],
  "MBCook": [
    {
      "by": "MBCook",
      "id": 30878951,
      "parent": 30878748,
      "text": "Based on what they said, no. Not at all.<p>Great read.",
      "time": 1648825999,
      "type": "comment"
    }
  ],
  "kingcharles": [
    {
      "by": "kingcharles",
      "id": 30880030,
      "parent": 30878748,
      "text": "MOT surely won&#x27;t check half the things that are wrong with this car though? Shitty starting, busted gearbox? Most 90s supercars wouldn&#x27;t pass if that was a problem :p<p>What do MOTs say about antique cars? I&#x27;ve had some really rough old Minis pass the MOT in the past.",
      "time": 1648830589,
      "type": "comment"
    },
    {
      "by": "kingcharles",
      "id": 30879984,
      "parent": 30879355,
      "text": "Yowch. I thought that limit was only for the other Channel Islands. At least in say, the Isle of Man, you can get it nicely into triple digits on a regular basis.",
      "time": 1648830368,
      "type": "comment"
    }
  ],
  "michaelt": [
    {
      "by": "michaelt",
      "id": 30879364,
      "parent": 30878992,
      "text": "Your vehicle will never develop this number of issues <i>on the day you buy it</i>.<p>You buy it with a trivial occasional issue that can be worked around, and the issue gradually starts happening more and more often and getting harder and harder to work around. And at the same time, another trivial issue will develop....<p>That&#x27;s how my motorcycle went from &#x27;needs to be kick-started&#x27; through &#x27;sometimes it takes a few tries&#x27;, through &#x27;bump starting works though&#x27;, to &#x27;you can bump start it within 6 attempts&#x27;, to &#x27;you can bump start it within 6 attempts, as long as you didn&#x27;t use the headlights too much last time you rode it&#x27;",
      "time": 1648827743,
      "type": "comment"
    }
  ],
  "unregistereddev": [
    {
      "by": "unregistereddev",
      "id": 30879258,
      "parent": 30878694,
      "text": "There&#x27;s a difference between bad cars and hilariously bad cars. The OG Chrysler minivan was historically significant. I respect people who still use them as work vehicles, or people who embrace the hacker mentality to turn them into something they weren&#x27;t originally (there are a few minivan dragsters). But they aren&#x27;t celebrated as great driver&#x27;s cars.<p>A better comparison to the Porsche 914 would be an MG roadster - or if you want to stick with Chrysler, then a Dodge Omni GLH. By modern standards both of these are unreliable, uncomfortable, and hard to drive, but like the 914 they are celebrated by enthusiasts. Part of the reason is because despite their flaws, and despite being relatively hard to drive, they reward skill. While slow to accelerate, they handle well - allowing a skilled driver to make good lap times on a track.",
      "time": 1648827367,
      "type": "comment"
    }
  ],
  "jrsj": [
    {
      "by": "jrsj",
      "id": 30878908,
      "parent": 30878694,
      "text": "You might be overanalyzing a bit. I think it really comes down to sports cars being cool &amp; vans being…vans. All the “Porsche” part really does is get more clicks (because people know what it is).",
      "time": 1648825842,
      "type": "comment"
    }
  ],
  "anarticle": [
    {
      "by": "anarticle",
      "id": 30879764,
      "parent": 30878694,
      "text": "Sheesh, it&#x27;s ok to like something! No one will think less of you.",
      "time": 1648829496,
      "type": "comment"
    }
  ],
  "RavingGoat": [
    {
      "by": "RavingGoat",
      "id": 30882490,
      "parent": 30879131,
      "text": "I think they make more from their YouTube content. I honestly had no idea they sold insurance before today but I love their YouTube videos.",
      "time": 1648842323,
      "type": "comment"
    }
  ],
  "masklinn": [
    {
      "by": "masklinn",
      "id": 30880199,
      "parent": 30879828,
      "text": "&gt; It always entertaining when Americans speaking about manual transmissions as something mysterious.<p>The car in question is at least 45 years old. That the transmission was never great and has degraded since is not at all odd. At no point did I see ragging on a manual, only the transmission being shot (and having a weird pattern).",
      "time": 1648831220,
      "type": "comment"
    },
    {
      "by": "masklinn",
      "id": 30880139,
      "parent": 30879348,
      "text": "From a video I saw recently I think some of the old lancias (group b stuff) were similar, the pattern was not shown but the driver referred to being careful with first so as not to launch the car in reverse.<p>So I’m guessing this was one of the standard gear patterns in the late 70s &#x2F; early 80s euros, back when car affordances were often nebulous concepts.",
      "time": 1648831016,
      "type": "comment"
    }
  ],
  "repiret": [
    {
      "by": "repiret",
      "id": 30880041,
      "parent": 30879828,
      "text": "I&#x27;m in the US and prefer manual transmissions, but I have to admit that the 6-8 speed automatic transmissions that have become popular in the last 5-10 years pretty much solves the &quot;always in the wrong gear&quot; problem that the 3-4 speed automatic transmissions of years past had.",
      "time": 1648830632,
      "type": "comment"
    }
  ],
  "imglorp": [
    {
      "by": "imglorp",
      "id": 30879960,
      "parent": 30879828,
      "text": "Sometimes double clutching helps with old American boxes. German ones have always been temperamental, compared to shaking a bag of wrenches.<p>Japanese ones have always been smooth and fun.<p>Source: I taught three teenagers to drive stick recently, and there are still teeth on the gears. Yay me!",
      "time": 1648830291,
      "type": "comment"
    }
  ],
  "BoorishBears": [
    {
      "by": "BoorishBears",
      "id": 30879946,
      "parent": 30879828,
      "text": "Most automatic transmissions are horrible because most cars are horrible.<p>Good cars have good transmissions, regardless of transmission style.<p>The ZF8 is an excellent transmission that&#x27;s seen everywhere.<p>PDK does justice to the most performant modern Porsches in a way that manuals struggle to keep up with.<p>Even relatively small volume DCTs like the one in the 4C are pretty great these days.",
      "time": 1648830235,
      "type": "comment"
    },
    {
      "by": "BoorishBears",
      "id": 30883531,
      "parent": 30880114,
      "text": "Now would not be a great time to be in that area when &quot;knockoff&quot; switches have pretty much out-innovated Cherry into irrelevance<p>But that aside, as other comments point out the ZF8 is not Audi specific, Plenty of non-M car BMWs use it, and even heavy duty pick up trucks are running with ZF8s now",
      "time": 1648848785,
      "type": "comment"
    }
  ],
  "foobarian": [
    {
      "by": "foobarian",
      "id": 30882308,
      "parent": 30879828,
      "text": "&gt; Europeans are surprised seeing you manipulating the wipers to control the transmission.<p>That is nothing new to a true European.  Look up the Renault 4 shifter :-)",
      "time": 1648841385,
      "type": "comment"
    }
  ],
  "systemvoltage": [
    {
      "by": "systemvoltage",
      "id": 30880089,
      "parent": 30879828,
      "text": "&gt; It always entertaining when Americans speaking about manual transmissions as something mysterious.<p>It is always entertaining to see European exceptionalism schooling up people in car forums. Please tell us about diesel engines too!",
      "time": 1648830844,
      "type": "comment"
    }
  ],
  "vincentmarle": [
    {
      "by": "vincentmarle",
      "id": 30880058,
      "parent": 30879828,
      "text": "Manual transmissions are great for anti-theft protection ;)",
      "time": 1648830725,
      "type": "comment"
    }
  ],
  "colburnmh": [
    {
      "by": "colburnmh",
      "id": 30883591,
      "parent": 30879441,
      "text": "It&#x27;s really a weird Volkswagen&#x2F;Porsche frankenstein, despite what the badge says. Porsche designed it, Volkswagen built it. Outside the US, the Volkswagon version is 914&#x2F;4, and the Porsche version being a 914&#x2F;6. (The last digit references the number of cylinders). In the US market both versions were branded as Porsche because US buyers were deemed unable to understand that two different car brands used the same body style. (Times have changed.)<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Porsche_914\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Porsche_914</a>",
      "time": 1648849156,
      "type": "comment"
    }
  ],
  "EastSmith": [
    {
      "by": "EastSmith",
      "id": 30880284,
      "parent": 30879441,
      "text": "Is the electric conversion still a thing? I want an eclectic car with no monitors, no software updates, no surveillance (none of the new electric car offers that - they are calling home for updates and god knows why way too often, and they have bigger monitors than my 14&quot; work laptop).",
      "time": 1648831529,
      "type": "comment"
    }
  ],
  "tricky": [
    {
      "by": "tricky",
      "id": 30879759,
      "parent": 30879441,
      "text": "Hello to a fellow member of the &quot;my first car was a Porsche&quot; club. Mine was a $400 924 that broke at least once a week. Good times.",
      "time": 1648829458,
      "type": "comment"
    }
  ],
  "hindsightbias": [
    {
      "by": "hindsightbias",
      "id": 30882222,
      "parent": 30879441,
      "text": "Those that haven’t burned (fuel injected high pressure fuel lines degraded and cracked) have rusted out, just sits too low to ground and can’t be left that way.<p>Rebuilt one at 16 and took it to college!",
      "time": 1648840821,
      "type": "comment"
    }
  ],
  "more_corn": [
    {
      "by": "more_corn",
      "id": 30880694,
      "parent": 30879441,
      "text": "I have an electric converted 914 if you want to pick it up. It’s even in need of a few battery packs so it won’t all be done before you get your hands on it.",
      "time": 1648833491,
      "type": "comment"
    }
  ],
  "NoImmatureAdHom": [
    {
      "by": "NoImmatureAdHom",
      "id": 30884966,
      "parent": 30881086,
      "text": "I am sorry for your loss.",
      "time": 1648861684,
      "type": "comment"
    }
  ],
  "rcrestomods": [
    {
      "by": "rcrestomods",
      "id": 30881178,
      "parent": 30880366,
      "text": "Easily my favorite essay of the year. Unique, informative and casual in the way sitting around a table listening to an engaging guest tell tales and the visualization works immediately. Count me among the fans of this piece and author.",
      "time": 1648835685,
      "type": "comment"
    }
  ],
  "tuatoru": [
    {
      "by": "tuatoru",
      "id": 30886091,
      "parent": 30880366,
      "text": "&gt; selecting first is a preposterous mixture of a delicate ballet and sledgehammering it home.<p>Double declutching is a lost art, it seems.<p>It involved moving the shifter into neutral, revving the engine still in neutral, and clutching and shifting into the gear when the RPMs were &quot;right&quot;. Skilled double-declutchers could shift nearly as quickly as ordinary drivers with syncromesh.<p>Common in older cars when I was young, in the proterozoic.<p>1. <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Double_clutch_(technique)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Double_clutch_(technique)</a>",
      "time": 1648878286,
      "type": "comment"
    }
  ],
  "KennyBlanken": [
    {
      "by": "KennyBlanken",
      "id": 30881442,
      "parent": 30880366,
      "text": "On the actual flip side, there are plenty of people who properly maintain vintage sports cars instead of just talking about how much they know about them.<p>I get that door handles and lock cylinders are often made of easily-broken pot metal, but most owner communities have figured out solutions, or just live a little and recognize that a locksmith can easily get you into almost any vintage car if necessary.<p>The starting problems mean your engine is poorly tuned&#x2F;maintained, battery issues are bad wiring or undiagnosed parasitic drain (or just buy a battery maintainer, dude), and thinking &quot;my first gear syncro is worn or my shift linkage isn&#x27;t properly adjusted, I should mash the shit out of it&quot; are purely owner error &#x2F; strongly counter-indicate &quot;I know a ton about cars.&quot;",
      "time": 1648836736,
      "type": "comment"
    },
    {
      "by": "KennyBlanken",
      "id": 30880700,
      "parent": 30880284,
      "text": "Most any vehicle with &quot;telematics&quot; available made in the last ~10 years is calling home with your location and a variety of information like cabin and outdoor air temperature, whether the wipers and headlights are on, etc. The data is sold to third parties, with varying levels of anonymization. This happens regardless of whether you&#x27;re paying for a subscription to their telematics, whether you have a GPS navigation system optioned, etc.<p>I know this because a friend worked for a company trying to monetize that data for weather forecasting.<p>If you want to disable this nonsense, just unplug the cellular antenna and connect it to a dummy load.",
      "time": 1648833510,
      "type": "comment"
    },
    {
      "by": "KennyBlanken",
      "id": 30880794,
      "parent": 30880446,
      "text": "Production EV battery packs almost always include some sort of BMS and have lots of interlocks and safeties. You don&#x27;t really have to do much to work with them other than to talk to the BMS and not exceed voltage and current limits. If you do, the BMS will trip the pack&#x27;s internal HV contactor.<p>Safely installing&#x2F;modding&#x2F;repairing automotive fuel systems is likely just as, if not more, dangerous if you don&#x27;t know what you&#x27;re doing. There are few interlocks on automotive fuel systems beyond &quot;if the engine stops spinning, turn off the fuel pump&quot; or in some vehicles, there might be a crash&#x2F;rollover fuel shutoff switch.<p>People think working on EVs is super scary when reality is that you can usually pull a cover in the rear passenger area, find and pull a bright orange plug, and the HV system is rendered completely safe. EVs don&#x27;t have a billion places you can scald or burn yourself, their &quot;engine&quot; compartments generally don&#x27;t have much or any spinning objects that could deglove your hands, there&#x27;s no fuel or oil to catch fire, no high pressure hydraulics...",
      "time": 1648833957,
      "type": "comment"
    }
  ],
  "cpfohl": [
    {
      "by": "cpfohl",
      "id": 30881022,
      "parent": 30879699,
      "text": "This also reminded me of this delightful piece of writing: <a href=\"https:&#x2F;&#x2F;forums.anandtech.com&#x2F;threads&#x2F;why-the-police-dont-patrol-brice-street-anymore.1294969&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;forums.anandtech.com&#x2F;threads&#x2F;why-the-police-dont-pat...</a><p>I can&#x27;t find the original, but the copy there is exactly what I remembered.",
      "time": 1648834953,
      "type": "comment"
    },
    {
      "by": "cpfohl",
      "id": 30881538,
      "parent": 30881301,
      "text": "Reading this out loud is incredibly difficult. Discovered it in my Sophomore year of College, and it took my two roommates and I about 45 minutes to read through the whole thing out loud because we were laughing so hard.",
      "time": 1648837168,
      "type": "comment"
    }
  ],
  "robohoe": [
    {
      "by": "robohoe",
      "id": 30881423,
      "parent": 30880219,
      "text": "Rennlist is huge in Porsche world.",
      "time": 1648836656,
      "type": "comment"
    }
  ],
  "Johnny555": [
    {
      "by": "Johnny555",
      "id": 30879820,
      "parent": 30879226,
      "text": "<i>how would anyone who&#x27;s not driven vehicles that are decades beyond their design life know</i><p>I think you just need to have driven a car from that era to understand this post and believe it -- the car doesn&#x27;t neccessarily need to be that old. I had a &#x27;77 Civic in 1982 and it had many of these same &quot;features&quot; as his Porsche - any key (or screwdriver) could open the door or turn the ignition, it had a manual choke lever installed because the automatic choke didn&#x27;t work, there was an art to pumping the gas pedal before starting in cold weather (there was a fine line between being able to start and  flooding it), there was no clutch interlock (or it was broken) to prevent starting the car in gear, and a bunch of other quirks similar to his.<p>And it was only 5 years old.<p>edit: And the oil use! I&#x27;d forgotten about that until reading his post, I used to carry a few jugs of oil in the trunk since the car was using almost a quart per fillup, and many gas stations kept a display case of oil out by the pumps so you could easily buy a quart if you needed it. My current 7 year old car doesn&#x27;t use any noticeable amount of oil between ~8000 mile oil changes.",
      "time": 1648829767,
      "type": "comment"
    }
  ],
  "a4isms": [
    {
      "by": "a4isms",
      "id": 30880085,
      "parent": 30879226,
      "text": "I don&#x27;t disagree with you, but I&#x27;m not sure I worry about it.<p>The article is presented as a letter to a car thief, a preposterous proposition right up front. It is not presented as a repair guide or an &quot;evaluate whether a 914 is worth buying&quot; guide, so it&#x27;s really only of interest for entertainment and nostalgia purposes.<p>There&#x27;s literally zero chance I&#x27;ll ever be in a conversation with someone and say aloud &quot;Oh, Porsche owners call this Neverland,&quot; and have to worry about someone interrupting me with, &quot;BS, I belong to a Porsche club and have never heard this nickname.&quot;",
      "time": 1648830828,
      "type": "comment"
    }
  ],
  "munchler": [
    {
      "by": "munchler",
      "id": 30879655,
      "parent": 30879226,
      "text": "Being able to bullshit entertainingly at this level of detail is an even greater talent. See Douglas Adams, for example.",
      "time": 1648829055,
      "type": "comment"
    }
  ],
  "travisjungroth": [
    {
      "by": "travisjungroth",
      "id": 30884169,
      "parent": 30879226,
      "text": "&gt; but how would anyone who&#x27;s not driven vehicles that are decades beyond their design life know?<p>By trusting someone who has. Either trust a specific person or believe there is someone in the crowd who would say something.",
      "time": 1648853961,
      "type": "comment"
    }
  ],
  "hinkley": [
    {
      "by": "hinkley",
      "id": 30884437,
      "parent": 30883982,
      "text": "Available and Unattended are the same thing. The third value is &#x27;Cheap&#x27;.<p>You want unattended servers? Fine. You want someone not to be able to steal the keys from a backup? We can do that too. You want the servers to be able to restart at 2 am without getting someone out of bed to come type a passphrase into a console on each server?<p>HSMs were quite expensive. People made any number of attempts to make them cheap and found out why they aren&#x27;t (Ari Shamir has entered the chat), often a Too Good to be True scenario.",
      "time": 1648856318,
      "type": "comment"
    },
    {
      "by": "hinkley",
      "id": 30884526,
      "parent": 30881325,
      "text": "&gt; since you can more easily shift between 2nd and 3rd gear in a quicker way<p>That is in part a secondary effect of how wide and crisp the offsets are between gears (how &#x27;deep&#x27; the H shape is). On the gear boxes people tend to like, going from 2nd to 3rd, and 3rd to 4th take very close to the same time. On my little roadster I&#x27;d just stomp on the clutch and throw the gear knob in the general vicinity of where it needed to be, relying on hand-eye coordination and the synchros to do the real work (I missed maybe 3 shifts a year, and half of those when I was tired).<p>Compare this to the car I learned stick on - the infamous Chevy Citation, made during the nadir of Detroit - where the gearbox was roughly shaped like an X, although at the time it felt like an l. I lost track of how many times I accidentally upshifted instead of downshifted at a stop sign, and that engine had less torque than an electric pencil sharpener, so the engine would simple stall the moment I tried to let the clutch out.<p>The roadster I subsequently drove, I experimented and found that if I was even a little careful I could get moving from a dead stop in 3rd gear. Basically a modified tractor engine. All torque, no horsepower.",
      "time": 1648857121,
      "type": "comment"
    }
  ],
  "drewzero1": [
    {
      "by": "drewzero1",
      "id": 30881953,
      "parent": 30881585,
      "text": "I love the K-Jetronic mechanical injection system in my &#x27;83 SAAB -- only because I&#x27;ve never had to mess with it very much. Plus, unlike a lot of the more obscure things on that car, the K-Jet system was also used on VWs, Porsches, and Mercedes, so there&#x27;s a lot of info out there.<p>A lot of this article rings true for cars I&#x27;ve had (and some I still have) but I tend toward cars that are simpler mechanically and tend to fail more fundamentally: the keys all lock fine but the suspension mounts all rust out. This year has been an exercise in chasing leaks (gas, brake fluid, coolant, and now ATF) between my two daily classics. All I need is power steering fluid and I can complete the whole set!",
      "time": 1648839282,
      "type": "comment"
    }
  ],
  "tyingq": [
    {
      "by": "tyingq",
      "id": 30879319,
      "parent": 30879255,
      "text": "If that sounds crazy, it is.  The M35 2 1&#x2F;2 ton truck shift pattern:\n<a href=\"https:&#x2F;&#x2F;live.staticflickr.com&#x2F;4130&#x2F;5082855966_efbf3c3f00_c.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;live.staticflickr.com&#x2F;4130&#x2F;5082855966_efbf3c3f00_c.j...</a><p>Also, odd, but the Citroen M35 has a similar name and shift pattern, even though it&#x27;s a car and completely unrelated.<p><a href=\"https:&#x2F;&#x2F;ranwhenparkeddotnet.files.wordpress.com&#x2F;2010&#x2F;11&#x2F;m352bshift2bpattern.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;ranwhenparkeddotnet.files.wordpress.com&#x2F;2010&#x2F;11&#x2F;m352...</a>",
      "time": 1648827571,
      "type": "comment"
    }
  ],
  "oliveshell": [
    {
      "by": "oliveshell",
      "id": 30880309,
      "parent": 30879255,
      "text": "You’re not kidding!  I first learned to drive stick in a deuce-and-a-half that my dad bought cheap at a surplus auction.<p>I accidentally shifted from 1st straight into 5th quite a few times.  The darn thing had so much torque that it wouldn’t even stall when you did that!",
      "time": 1648831626,
      "type": "comment"
    }
  ],
  "ourmandave": [
    {
      "by": "ourmandave",
      "id": 30881217,
      "parent": 30879255,
      "text": "Reminds me of the <i>Terminator</i> when he commanders the tanker truck and pulls up the schematics by scanning the shift lever.<p>They should have had a throwaway scene where he tries to steal a Deuce from an armory and it comes up, &quot;File Not Found.&quot;<p>Or he&#x27;s throwing errors and has to reboot himself trying to find 4th.",
      "time": 1648835827,
      "type": "comment"
    }
  ],
  "reedjosh": [
    {
      "by": "reedjosh",
      "id": 30879957,
      "parent": 30879552,
      "text": "I wonder if the linkage could be replaced by a cable?<p>My 77 Firebird has aftermarket shift and throttle cables.<p>Of course, my Firebird is an automatic, so who knows. Maybe a two cable system would do?",
      "time": 1648830280,
      "type": "comment"
    }
  ],
  "RajT88": [
    {
      "by": "RajT88",
      "id": 30879508,
      "parent": 30879348,
      "text": "Not just press down on shift knob, but a bit to the side too.<p>On my old Jetta (left hand drive), it was more like &quot;Up and to the Left a little bit&quot;, and not a straight throw from first.",
      "time": 1648828374,
      "type": "comment"
    }
  ],
  "logifail": [
    {
      "by": "logifail",
      "id": 30881234,
      "parent": 30879348,
      "text": "&gt; this shift pattern is just standard on German cars with manual transmission<p>&quot;Standard?&quot;   Hmm.   We have two cars with manual transmission, a VW Sharan and a VW Up:<p>The Sharan has R at the top left, then (reading across) 1 3 5 with 2 4 6 below; so 6th is at the bottom right.<p>The Up only has 5 forward gears, but for some reason they decided to put R <i>at the bottom right</i> (so down from 5th...   you can probably see where this story is going)<p>I have once, and only once, been driving along at motorway speed in the Up, in 5th, and briefly thought I was in the Sharan, and started trying to change up to 6th, except the Up only has 5, <i>and</i> you&#x27;re heading for R, not 6th.   Happily I didn&#x27;t complete the change...",
      "time": 1648835917,
      "type": "comment"
    },
    {
      "by": "logifail",
      "id": 30886841,
      "parent": 30885289,
      "text": "&gt; Reverse in the bottom right is the “normal” 5-speed reverse spot no?<p>I&#x27;ve driven a lot of 5-speed manual transmission rental cars over the decades, and my impression is that reverse in the top left is (or certainly was) the far more common layout:<p><pre><code>  R 1 3 5\n    2 4\n</code></pre>\nOur previous car, also a VW, had this layout too.",
      "time": 1648890065,
      "type": "comment"
    }
  ],
  "telesilla": [
    {
      "by": "telesilla",
      "id": 30879753,
      "parent": 30879348,
      "text": "First time I rented a German car I yelled out in the parking garage for help! Some kind strangers explained this to me about the reverse and I got on my way.",
      "time": 1648829427,
      "type": "comment"
    }
  ],
  "Root_Denied": [
    {
      "by": "Root_Denied",
      "id": 30881129,
      "parent": 30879348,
      "text": "I had a &#x27;92 Nissan Sentra as my first car in the early 2000&#x27;s, a hand-me-down from my older brother - it also had this dog-leg shift pattern. Looks like it wasn&#x27;t just German cars that had this transmission.<p>Definitely burned out a clutch early from learning to drive and learning to drive stick at the same time, but damn do I miss it sometimes.",
      "time": 1648835491,
      "type": "comment"
    }
  ],
  "_whiteCaps_": [
    {
      "by": "_whiteCaps_",
      "id": 30880532,
      "parent": 30879348,
      "text": "My Ford Contour SVT (Mondeo in the UK I think?) had a collar under the shift knob that you had to pull upwards to shift into reverse. Had never seen that before, and I felt awfully embarrassed to ask the guy selling me the car how it worked.",
      "time": 1648832613,
      "type": "comment"
    }
  ],
  "city41": [
    {
      "by": "city41",
      "id": 30884000,
      "parent": 30879806,
      "text": "Nowadays it seems just having a manual transmission is enough to deter most thieves. I once took my car to get the oil changed and I had to drive it into and out of the bay as no employee knew how.",
      "time": 1648852455,
      "type": "comment"
    }
  ],
  "IgorPartola": [
    {
      "by": "IgorPartola",
      "id": 30881235,
      "parent": 30879197,
      "text": "I keep reading stories if people going to track day on their liter bikes and getting outrun by the instructor riding a 250cc scooter.",
      "time": 1648835917,
      "type": "comment"
    }
  ],
  "userbinator": [
    {
      "by": "userbinator",
      "id": 30882549,
      "parent": 30882381,
      "text": "The aftermarket for mid-century American cars is huge.",
      "time": 1648842674,
      "type": "comment"
    },
    {
      "by": "userbinator",
      "id": 30882480,
      "parent": 30881670,
      "text": "The Buick Dynaflow was almost entirely reliant on a multiple-element torque converter, in front of a 2-speed manual similar to the Powerglide. Slow and inefficient, but very smooth.",
      "time": 1648842264,
      "type": "comment"
    }
  ],
  "BizarroLand": [
    {
      "by": "BizarroLand",
      "id": 30880713,
      "parent": 30879908,
      "text": "You will also need a Raspberry Pi 19 and a GSM transmit module to impersonate the old-timey cell towers they used to use. You can purchase one for about $3 or so and run this script...",
      "time": 1648833579,
      "type": "comment"
    }
  ],
  "alhirzel": [
    {
      "by": "alhirzel",
      "id": 30882414,
      "parent": 30879294,
      "text": "Related to this, one of my stories about turning a car off.... I was a misguided youth rebuilding a Subaru that sat in a field for a long time. It had many problems, but overhauling the engine solved all of them (or so I had naively planned). I remember the first drive I took with it after getting plates on it. Right after filling the tank for the first time, I went to Taco Bell, bought a victory taco, and went to a parking lot to look over my city and eat. When I tried to shift into park, the cable snapped. Dejectedly, I sat and ate the taco with my foot on the brake, warming the ATF while I figured out what to do. Several factors stacked against me, including that I lived on a hill, didn&#x27;t have a garage, the e-brake was rusted, and it was January in one of the snowiest areas in Michigan (3-4ft snow banks in most places). I knew the next time I flipped the car off would really count, because I would have to hot wire the NSS or fix the cable to get rolling again. Parking in the winter is a huge problem too: you will get towed or fined for getting in the way of snow removal. I ended up precariously &quot;parking&quot; the car in drive near my house with a combination of gravity and a snow bank. I set the ramps up, crossing my fingers that they were spaced correctly and that I would succeed in getting on them on the first try. It all worked out, and when I finally turned the car off, I felt pretty intellectually victorious.",
      "time": 1648841937,
      "type": "comment"
    }
  ],
  "bsder": [
    {
      "by": "bsder",
      "id": 30886174,
      "parent": 30881570,
      "text": "&gt; I absolutely recommend old cars to everyone, as mentioned elsewhere in this thread they build character.<p>I don&#x27;t think I hate another human enough to wish diagnosing an intermittent ground problem that only occured when the temperature fell below 30F on them.<p>Character it may build, but even to this day I would trade that character for fewer knuckle scars and fewer hours with numb hands from the cold.<p>I&#x27;ll take my modern car that lasts until some idiot hits me and totals it.",
      "time": 1648879755,
      "type": "comment"
    }
  ],
  "AdmiralAsshat": [
    {
      "by": "AdmiralAsshat",
      "id": 30879016,
      "parent": 30878963,
      "text": "There&#x27;s no way that car would pass an emissions test.",
      "time": 1648826280,
      "type": "comment"
    }
  ],
  "hedora": [
    {
      "by": "hedora",
      "id": 30880104,
      "parent": 30879717,
      "text": "Contrasting that to California, I had an old well-maintained Volvo station wagon.   California tightened the emissions standards on that model until it failed smog (at 110% of NOX limit), and made me upgrade the catalytic to an after market one.  It then passed at 85% the NOX limit.<p>The state strongly encouraged me to send it to a Golden Shield mechanic.  As part of the work, they &quot;checked&quot; the air intake filter and MAF sensor on the engine, which was, of course, filthy.  It sits in a big plastic box on that car.  Instead of reinstalling the filter, they jammed it in sideways and closed the box.  I figured it out later, and spent about an hour picking bits of leaves out of the downstream air intake.<p>Of course, this cost 95% of the limit past which California gives you a free pass till the next smog inspection.  (And almost 2x the market value of the car.)<p>I&#x27;m convinced the whole thing is a make-work program that&#x27;s holding our air quality hostage.  (And I&#x27;m strongly for tightening emissions standards!)",
      "time": 1648830906,
      "type": "comment"
    }
  ],
  "rascul": [
    {
      "by": "rascul",
      "id": 30879815,
      "parent": 30879717,
      "text": "Many states barely even check anything anyway. Out of six states I&#x27;ve had a vehicle inspection in, only one (Maryland) did more than check lights, wipers, brakes, and horn. Inspections seem to be more a revenue stream than anything else.",
      "time": 1648829742,
      "type": "comment"
    },
    {
      "by": "rascul",
      "id": 30879078,
      "parent": 30879016,
      "text": "Not all states test emissions, either.",
      "time": 1648826556,
      "type": "comment"
    },
    {
      "by": "rascul",
      "id": 30885098,
      "parent": 30882411,
      "text": "&gt; I think most states will fail a car with the &quot;check engine&quot; light on.<p>Except Maryland, none of the states I&#x27;ve done an inspection looked inside the vehicle. The states that did emissions would fail if check engine light is on, but if you disconnect the battery right before to reset it then they might pass it.",
      "time": 1648863113,
      "type": "comment"
    }
  ],
  "marcosdumay": [
    {
      "by": "marcosdumay",
      "id": 30879945,
      "parent": 30879717,
      "text": "How do you tell if there is no vehicle failing because your inspection takes them off the roads or if it&#x27;s because nobody wants them anyway?<p>Any kind of policing is self-denying. You can&#x27;t evaluate it while it&#x27;s being applied.",
      "time": 1648830234,
      "type": "comment"
    }
  ],
  "FDSGSG": [
    {
      "by": "FDSGSG",
      "id": 30886909,
      "parent": 30879438,
      "text": "&gt; Author is in NC, same as me<p>This hardly matters though because you don&#x27;t need to register the vehicle in the state you&#x27;re living in.",
      "time": 1648891095,
      "type": "comment"
    }
  ],
  "dilap": [
    {
      "by": "dilap",
      "id": 30879044,
      "parent": 30878826,
      "text": "re ③, on...purpose?",
      "time": 1648826422,
      "type": "comment"
    }
  ],
  "sgt": [
    {
      "by": "sgt",
      "id": 30882338,
      "parent": 30879716,
      "text": "Didn&#x27;t Tyler Hoover (on YouTube) put an LS motor in a Porsche 911? He got some hate for that.",
      "time": 1648841534,
      "type": "comment"
    }
  ],
  "Rebelgecko": [
    {
      "by": "Rebelgecko",
      "id": 30879415,
      "parent": 30878908,
      "text": "On the flip side, the sports car snobs will say that a 914 (especially the 4 cylinder version) is basically just a funky looking Volkswagen :)",
      "time": 1648827966,
      "type": "comment"
    }
  ],
  "donw": [
    {
      "by": "donw",
      "id": 30884726,
      "parent": 30883591,
      "text": "The author has neglected to mention that you can find the engine by shouting &quot;Gerald! Gerald!&quot; at the top of your lungs in all directions.<p>This will summon the ancient, exhausted hamster that powers the vehicle.",
      "time": 1648859104,
      "type": "comment"
    }
  ],
  "gambiting": [
    {
      "by": "gambiting",
      "id": 30880662,
      "parent": 30880284,
      "text": "&gt;&gt;none of the new electric car offers that<p>Eh? I literally got a brand new electric VW e-Up last week, it&#x27;s exactly that. It even still has analog dials, and VW provides a mount for your phone instead of an &quot;infotainment&quot; system. The height of sophistication is DAB radio and heated front window and seats.<p>I highly recommend it, it&#x27;s a hoot - and with 150 miles range and rapid charging capability it&#x27;s more than enough for all my needs.<p>That&#x27;s the dashboard in it, it&#x27;s as &quot;bare minimum&quot; as it gets:\n<a href=\"https:&#x2F;&#x2F;media.drivingelectric.com&#x2F;image&#x2F;private&#x2F;s--7PGbPUr6--&#x2F;f_auto,t_primary-image-desktop@1&#x2F;v1597796103&#x2F;drivingelectric&#x2F;2020-03&#x2F;dsc_6606.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;media.drivingelectric.com&#x2F;image&#x2F;private&#x2F;s--7PGbPUr6-...</a>",
      "time": 1648833322,
      "type": "comment"
    }
  ],
  "distortedsignal": [
    {
      "by": "distortedsignal",
      "id": 30880446,
      "parent": 30880284,
      "text": "Ford will sell you an electric crate engine for $4k [1]. At that point, I think it&#x27;s up to you to supply the other parts of the system.<p>I assume that at this point there are enough wrecks of Model S&#x2F;X&#x2F;3&#x2F;Y that you should be able to pick up electric motors from them at junkyards.<p>The thing I really worry about with electric swaps is battery. You could have a Note 7 situation on your hands _real easy_ if you&#x27;re not careful.<p>[1] <a href=\"https:&#x2F;&#x2F;performanceparts.ford.com&#x2F;part&#x2F;M-9000-MACHE\" rel=\"nofollow\">https:&#x2F;&#x2F;performanceparts.ford.com&#x2F;part&#x2F;M-9000-MACHE</a>",
      "time": 1648832248,
      "type": "comment"
    },
    {
      "by": "distortedsignal",
      "id": 30885353,
      "parent": 30880794,
      "text": "Is there a place you know of to get production EV battery packs? I&#x27;m an amateur mechanic, and this might be up my alley, but (as above) I&#x27;m worried about these battery fire situations.",
      "time": 1648866236,
      "type": "comment"
    }
  ],
  "jrockway": [
    {
      "by": "jrockway",
      "id": 30881791,
      "parent": 30880284,
      "text": "People do electric conversions.  I&#x27;ve been randomly watching someone on YouTube convert an old Jaguar: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;c&#x2F;superfastmatt\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;c&#x2F;superfastmatt</a><p>Being an automotive engineer that worked for Tesla seems to be helpful, though.",
      "time": 1648838391,
      "type": "comment"
    }
  ],
  "zrm": [
    {
      "by": "zrm",
      "id": 30886178,
      "parent": 30880284,
      "text": "Is anybody doing surveillance conversions?<p>Like take a stock Tesla, throw out the computer it comes with and replace it with one that doesn&#x27;t spy on you. Keep everything else.<p>Probably easier than doing the reverse, isn&#x27;t it?",
      "time": 1648879867,
      "type": "comment"
    }
  ],
  "hadlock": [
    {
      "by": "hadlock",
      "id": 30881124,
      "parent": 30880284,
      "text": "The inverter&#x2F;regen braking, and charger units do have <i>some</i> firmware, but once everything is wired up and working, should work indefinitely without future OTA updates. If the national charging standard changes at some point in the future (or gets exported to another area (europe) that uses a different standard) you&#x27;ll need to swap out the charger.<p>Companies like EV West in California and Swindon in the UK offer bolt-in kits for 1960s cars, in particular the VW Beetle and the original Cooper Mini<p>Long term, as engine parts become harder to source, especially for low volume european cars, Electric Conversion is rapidly becoming the accepted way to keep these classics on the road for another 100 years.",
      "time": 1648835467,
      "type": "comment"
    },
    {
      "by": "hadlock",
      "id": 30881818,
      "parent": 30881730,
      "text": "Agreed; I suspect the reason why the VW has been targeted by EV makers is largely because the tuner&#x2F;enthusiast crowd is quite large, and also it&#x27;s an extremely well understood&#x2F;documented platform. I haven&#x27;t seen the EV West stuff up close in person yet, but it looks like as a platform to develop a set of standard equipment for other cars, the VW is a good initial choice for those reasons.<p>I have a similarly size&#x2F;weight prewar french car, and  when the engine finally gives out, will probably pull out the petrol engine and swap in a VW kit, but with a custom bell housing adapter. A 70-100hp electric motor meant for a VW is not a lot of power, but can provide enough low end torque to keep the car driving in modern traffic for 100-130 miles, which is probably enough for the use classic cars get.",
      "time": 1648838543,
      "type": "comment"
    }
  ],
  "zamfi": [
    {
      "by": "zamfi",
      "id": 30881774,
      "parent": 30880284,
      "text": "&gt; they have bigger monitors than my 14&quot; work laptop<p>Unfortunately, though you might find one with a smaller screen, you won&#x27;t find ANY new car with no screen these days -- backup cameras (and, by implication, a screen to see its feed) have been required on new cars in the US since 2018.",
      "time": 1648838328,
      "type": "comment"
    }
  ],
  "hathawsh": [
    {
      "by": "hathawsh",
      "id": 30883300,
      "parent": 30880284,
      "text": "I&#x27;ve been watching the Hummer conversion project from JerryRigEverything. It&#x27;s a great series because he&#x27;s not an expert on EVs, but he&#x27;s competent with tools. <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=YxkPuEmIX4U&amp;list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=YxkPuEmIX4U&amp;list=PL0vZL9uwyf...</a>",
      "time": 1648847117,
      "type": "comment"
    }
  ],
  "pards": [
    {
      "by": "pards",
      "id": 30880626,
      "parent": 30880284,
      "text": "This x 100. My next car will probably have to be electric but I need it to be bare bones, serviceable and FOSS. DIY might be the only option",
      "time": 1648833109,
      "type": "comment"
    }
  ],
  "zitterbewegung": [
    {
      "by": "zitterbewegung",
      "id": 30883723,
      "parent": 30880284,
      "text": "Yea electric conversion is a thing and according to Rich rebuilds they are making better kits instead of wiring everything manually.<p>But like all car projects it’s a money pit. Expect to spend $50k in parts and labor. And it may or may not be street legal for that price.<p>Driving the vehicle in places where you don’t have cell service or where it can be cold would be a bad idea if the conversion breaks down. Or just get a satellite phone and AAA.",
      "time": 1648850059,
      "type": "comment"
    }
  ],
  "elihu": [
    {
      "by": "elihu",
      "id": 30883881,
      "parent": 30880284,
      "text": "It&#x27;s still a thing.  It&#x27;s a lot of work though and it pretty much never makes financial sense versus just buying a used Leaf or something.  But it&#x27;s one way to get a car that&#x27;s exactly what you want.<p>I&#x27;m currently working on converting a Mazda RX-8.",
      "time": 1648851430,
      "type": "comment"
    }
  ],
  "trainsarebetter": [
    {
      "by": "trainsarebetter",
      "id": 30885190,
      "parent": 30880284,
      "text": "Check out the openinverter.org&#x2F;wiki project.\nit’s very active, lots of development and backing going on<p>I also design a variety of parts for adapting oem ev parts for other vehicles www.bratindustries.net",
      "time": 1648864302,
      "type": "comment"
    }
  ],
  "jimnotgym": [
    {
      "by": "jimnotgym",
      "id": 30884018,
      "parent": 30880284,
      "text": "It definitely is a thing for classic cars. These people even have a discovery channel show about them. They look awesome,  and are within easy electric range of my house!<p><a href=\"https:&#x2F;&#x2F;www.electricclassiccars.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.electricclassiccars.co.uk</a>",
      "time": 1648852615,
      "type": "comment"
    }
  ],
  "sgustard": [
    {
      "by": "sgustard",
      "id": 30884254,
      "parent": 30880284,
      "text": "Check out <a href=\"https:&#x2F;&#x2F;www.everrati.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.everrati.com</a> for electric conversions.",
      "time": 1648854699,
      "type": "comment"
    }
  ],
  "skykooler": [
    {
      "by": "skykooler",
      "id": 30880447,
      "parent": 30880284,
      "text": "Yep! There are some good resources at <a href=\"https:&#x2F;&#x2F;evwest.com\" rel=\"nofollow\">https:&#x2F;&#x2F;evwest.com</a> (not affiliated but have bought parts from there before).",
      "time": 1648832253,
      "type": "comment"
    }
  ],
  "chrisdhoover": [
    {
      "by": "chrisdhoover",
      "id": 30884880,
      "parent": 30879759,
      "text": "I have a 65&#x2F;66 912 converted to a 2.7 liter six. I love\nthis car.<p>When I got it there were issues. I have worked through many of them. The PO did not understand the regulator for instance. I gutted the wiring and redid it. It now charges and  there is no battery drain.<p>Like OP the lights were not good. I replaced those with LEDs. The suspension was worn, it was completely replaced.<p>The engine has good compression and the leak down showed it was healthy. It did leak oil though, sealed the engine. It no longer leaks.<p>You can’t just buy one of these cars and drive it. You have to wrench on it. It takes care and feeding.<p>I find it rewarding",
      "time": 1648860695,
      "type": "comment"
    }
  ],
  "hef19898": [
    {
      "by": "hef19898",
      "id": 30882511,
      "parent": 30879759,
      "text": "Those are slowly gett;ng expensive as well. 928s seem to be reasonably priced so far. No wonder with a car that was barely considered a Porsch back the day.<p>It was one of the potential follow up projects, once the first one is done. That will take at least another two years... And I won&#x27;t get permission for another project car in our drive way!",
      "time": 1648842437,
      "type": "comment"
    },
    {
      "by": "hef19898",
      "id": 30882743,
      "parent": 30881508,
      "text": "Getting the proper workshop manuals really helps!",
      "time": 1648843679,
      "type": "comment"
    },
    {
      "by": "hef19898",
      "id": 30882882,
      "parent": 30880877,
      "text": "Reminds me of the bad rep the 2.4 VM turbo diesel got in the Range Rover Classic. Good engine, used in some Chryslers, and boats, from the 80s to the early 2000s. Why? Because the Land Rover engineers mounted the cooling flyid tank too low, the 5th (?) cylinder risked not getting enough cooling and tended to crack. The fix is to mount the cooling tank a couple of cm higher up in the engine bay.",
      "time": 1648844449,
      "type": "comment"
    },
    {
      "by": "hef19898",
      "id": 30882681,
      "parent": 30881741,
      "text": "Good to see there other vintage cars, dare I say, lovers out there that see things that way. Mine is a 1982 Range Rover, bought like almost 4 years ago before people started to ask absurd prices for those.<p>It&#x27;s leaking oil from the oil cooler thermostat, the gearbox and started a while ago leaking from the transmission break. Oh, and the rear diff pinion is leaking, too. The 3.5 l V8, basically a Buick 215 allumium small block running on dual carbs, needs some gentle treatment before firing up. It usually does, a slight carb rebuild and calibrating really helped. The gearbox is more suited to a tractor and has all of four gears. The rear windows don&#x27;t work and the upper tailgate doesn&#x27;t close on its lock but uses two outside locks on each side.<p>It is rust free so, noise levels are acceptable below 110 km&#x2F;h and she&#x27;s a beast off road. Yes, I drive her in the intended environment, regularly.<p>I have hopes to get her finally done in the next 1, 2 years. And I love this rolling restauration thing. Only was close to selling her once, until I figured out I reassembled the choke wrong and drove fuel consumption up to 30 l per 100 km.",
      "time": 1648843362,
      "type": "comment"
    },
    {
      "by": "hef19898",
      "id": 30882698,
      "parent": 30881548,
      "text": "Never fully broken, never fully repaired.",
      "time": 1648843445,
      "type": "comment"
    }
  ],
  "polynomial": [
    {
      "by": "polynomial",
      "id": 30880877,
      "parent": 30879759,
      "text": "The 924 had a design flaw in the engine. The oil pressure sensor was located in the oil pan at the base of the return pipe to the cam, rather than at the top of the pipe at the cam. Thus, the pipe could become clogged and no oil would reach the cam shaft, while giving no indication of the problem. Needless to say, this could be very bad.",
      "time": 1648834367,
      "type": "comment"
    }
  ],
  "f38zf5vdt": [
    {
      "by": "f38zf5vdt",
      "id": 30880215,
      "parent": 30879759,
      "text": "924 here too! Totalled it (not that there was much to total) at the age of 20. May it rest in pieces.",
      "time": 1648831288,
      "type": "comment"
    }
  ],
  "vasco": [
    {
      "by": "vasco",
      "id": 30886338,
      "parent": 30886091,
      "text": "You can do a similar thing in motorcycles by rev-matching, this way you don&#x27;t even need to pull the clutch to switch gears.",
      "time": 1648882287,
      "type": "comment"
    }
  ],
  "kelnos": [
    {
      "by": "kelnos",
      "id": 30881616,
      "parent": 30881442,
      "text": "I think this guy&#x27;s bona-fides are pretty solid, though:<p>&gt; <i>Norman Garrett was the Concept Engineer for the original Miata back in his days at Mazda’s Southern California Design Studio. He currently teaches automotive engineering classes at UNC-C’s Motorsports Engineering Department in Charlotte, North Carolina and curates his small collection of dysfunctional automobiles and motorcycles.</i><p>I imagine some of this was written tongue-in-cheek: the problems are probably not as bad as described, and&#x2F;or the problems are things that have been wrong with the car at some point, but have mostly been fixed, and he&#x27;s writing about it as if all the problems exist at once for entertainment value.<p>Or it&#x27;s all true as it is, and that&#x27;s just life, because people don&#x27;t always have 100 spare hours to fix all the problems present on a car of that age.  Maybe you do (how lucky for you!), but it&#x27;s a bit uncharitable to throw shade at someone else.",
      "time": 1648837518,
      "type": "comment"
    }
  ],
  "The-Bus": [
    {
      "by": "The-Bus",
      "id": 30881586,
      "parent": 30881442,
      "text": "I think a faculty at a Motorsports Engineering School probably knows how to maintain vintage sports cars. Just because they own the car does not mean they need to maintain it.<p>This is also a humor article.",
      "time": 1648837365,
      "type": "comment"
    }
  ],
  "NickRandom": [
    {
      "by": "NickRandom",
      "id": 30882487,
      "parent": 30881442,
      "text": "From the end of the article ..<p><i>Norman Garrett was the Concept Engineer for the original Miata back in his days at Mazda’s Southern California Design Studio. He currently teaches automotive engineering classes at UNC-C’s Motorsports Engineering Department in Charlotte, North Carolina and curates his small collection of dysfunctional automobiles and motorcycles.</i><p>I&#x27;m fairly certain that he knows how to &#x27;fix stuff&#x27;",
      "time": 1648842292,
      "type": "comment"
    }
  ],
  "hallway_monitor": [
    {
      "by": "hallway_monitor",
      "id": 30881301,
      "parent": 30881022,
      "text": "That was some of the best storytelling I have ever read. Wow.",
      "time": 1648836173,
      "type": "comment"
    }
  ],
  "emilsedgh": [
    {
      "by": "emilsedgh",
      "id": 30886299,
      "parent": 30881022,
      "text": "Haven&#x27;t had such a laugh for a while. Thanks!",
      "time": 1648881816,
      "type": "comment"
    }
  ],
  "chernevik": [
    {
      "by": "chernevik",
      "id": 30881522,
      "parent": 30881022,
      "text": "&quot;&#x27;It&#x27;s just a bunny&#x27;, they all say&quot; -- Tim the Wizard",
      "time": 1648837113,
      "type": "comment"
    }
  ],
  "pwg": [
    {
      "by": "pwg",
      "id": 30881281,
      "parent": 30879820,
      "text": "&gt; I think you just need to have driven a car from that era to understand this post and believe it<p>Yes, indeed.  My first car when I turned 16 was a well beaten 1971 Cadillac that had it&#x27;s share of rust and the like.  The author&#x27;s description of the gas pedal ballet for starting his 914 reminded me of a similar situation with that old Cadillac.  For a cold start, all was normal, pump once to set choke and start.<p>But, for a warm start, one had to hold the pedal down &#x2F;just the right amount off idle&#x2F; or else it would not start up for most attempts.  And of course for a semi-warm start there was a decision process of &quot;is it cold enough to need the choke, or warm enough to only need the &quot;slightly off idle&quot; setting&quot;.  One got a &quot;feel&quot; for just what to do after a bit of time with it and it became no-big-deal, but for anyone new, the whole ballet would have been a very frustrating experience.<p>When it finally was retired and I upgraded to a car with a fuel injected engine, and no need to touch the gas pedal for any start, hot, cold or warm, a whole era of &quot;being in tune with the car&quot; disappeared.",
      "time": 1648836092,
      "type": "comment"
    },
    {
      "by": "pwg",
      "id": 30881330,
      "parent": 30879648,
      "text": "&gt; A really good author could probably make this up<p>True, but what &#x2F;really&#x2F; makes the humor in this article, when one has the domain knowledge to understand the technical details, is that every single technical humor bit is true and accurate, and brings back similar memories of similar ballets with similar vehicles from years ago.",
      "time": 1648836298,
      "type": "comment"
    }
  ],
  "wingspar": [
    {
      "by": "wingspar",
      "id": 30881122,
      "parent": 30879820,
      "text": "No clutch interlock can be useful. Had a friend growing up who’s dad would use the starter and first gear to move his Datsun out of traffic when it stopped running.",
      "time": 1648835462,
      "type": "comment"
    }
  ],
  "Wowfunhappy": [
    {
      "by": "Wowfunhappy",
      "id": 30879648,
      "parent": 30879333,
      "text": "A really good author could probably make this up. Some types of writing require that ability. Imagine you&#x27;re writing about a fantasy world where everyone drives giant Bloops instead of cars. You might have a few chapters written from the perspective of a master Bloop mechanic. She&#x27;s been fixing Bloops for as long as she can remember; she considers it her life&#x27;s calling and she loves every moment of her work. The author needs to communicate that to the reader in a believable way.<p>But if you&#x27;re not writing speculative fiction, what would be the point? It&#x27;s probably harder than writing about something you know!",
      "time": 1648829003,
      "type": "comment"
    },
    {
      "by": "Wowfunhappy",
      "id": 30885360,
      "parent": 30881330,
      "text": "<i>Absolutely,</i>, but in order to discern that, the reader needs to have some technical knowledge themselves.<p>Ergo, I think what throwaway0a5e said above has a lot of merit, even if I wouldn&#x27;t have stated it in in such absolutest terms:<p>&gt; Depth of knowledge is impossible to assess for anyone that doesn&#x27;t have similar depth in the same subject matter.",
      "time": 1648866306,
      "type": "comment"
    }
  ],
  "lvh": [
    {
      "by": "lvh",
      "id": 30880963,
      "parent": 30880309,
      "text": "Much better than shifting from 5th straight into 1st though :)",
      "time": 1648834722,
      "type": "comment"
    }
  ],
  "formerly_proven": [
    {
      "by": "formerly_proven",
      "id": 30886969,
      "parent": 30881234,
      "text": "On both of these transmissions you should need to push the knob in to get into R though.",
      "time": 1648892146,
      "type": "comment"
    }
  ],
  "mikeryan": [
    {
      "by": "mikeryan",
      "id": 30885289,
      "parent": 30881234,
      "text": "<i>but for some reason they decided to put R at the bottom right</i><p>Reverse in the bottom right is the “normal” 5-speed reverse spot no?",
      "time": 1648865497,
      "type": "comment"
    }
  ],
  "LanceH": [
    {
      "by": "LanceH",
      "id": 30881371,
      "parent": 30880541,
      "text": "The mid engine induced balance and short wheelbase on the 914 just made it ridiculous for autocross.  It was like playing a video game where you stick to the ground.  I certainly raced more powerful and faster cars, but it was possible to coax everything out of the 914 with an ease that few other cars could match.",
      "time": 1648836448,
      "type": "comment"
    }
  ],
  "spaetzleesser": [
    {
      "by": "spaetzleesser",
      "id": 30882478,
      "parent": 30880541,
      "text": "Sounds a bit like my Lotus Elise. I never tried autocross but that car loved tight not too high speed tracks.",
      "time": 1648842246,
      "type": "comment"
    }
  ],
  "jorts": [
    {
      "by": "jorts",
      "id": 30879151,
      "parent": 30879016,
      "text": "In CA &quot;The California Smog Check Program requires vehicles that were manufactured in 1976 or later to participate in the biennial (every two years) smog check program in participating counties.&quot; so it would be exempt based on the year that it was manufactured.",
      "time": 1648826892,
      "type": "comment"
    }
  ],
  "bell-cot": [
    {
      "by": "bell-cot",
      "id": 30880614,
      "parent": 30879016,
      "text": "Unless the Official Emissions Test rules state that the tech performing the test has to start it, and that it can&#x27;t be failed unless the emissions are too high when it&#x27;s running...",
      "time": 1648833063,
      "type": "comment"
    }
  ],
  "fps": [
    {
      "by": "fps",
      "id": 30882411,
      "parent": 30879815,
      "text": "I think most states will fail a car with the &quot;check engine&quot; light on.  For cars in the northeast, keeping the CEL off gets more and more expensive every winter. I had a truck that was getting a new oxygen sensor (there were 6 on the car) every year from age 8 to 12. The truck drove fine with them malfunctioning, but it couldn&#x27;t pass inspection. My current Jeep, I assume is going to need about $2K every year in maintenance to get it to pass inspection.  And the only reason to do the maintenance is the inspection, because it also drives fine.",
      "time": 1648841916,
      "type": "comment"
    }
  ],
  "prova_modena": [
    {
      "by": "prova_modena",
      "id": 30881367,
      "parent": 30880114,
      "text": "It&#x27;s been used by numerous manufacturers in addition to Audi, including BMW and seemingly every FCA&#x2F;Stellantis brand. I&#x27;ve driven a BMW 5 series fitted with one and I can confirm it&#x27;s a great transmission that is smooth and capable during normal driving, but has reasonable sportiness when required.<p>See <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;ZF_8HP_transmission\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;ZF_8HP_transmission</a>",
      "time": 1648836426,
      "type": "comment"
    }
  ],
  "riedel": [
    {
      "by": "riedel",
      "id": 30886621,
      "parent": 30886495,
      "text": "I remember it being referred to as Volksporsche. It was a strange mix of feelings. Nobody took it as a serious Porsche while owners that normally wouldn&#x27;t be able to afford a &#x27;real&#x27; one really loved the car for it quirks. To me this is a much better Volksporsche than the Cayenne&#x2F;Touareg . And in hindsight the people who loved this democratized version of a sports car have a better place in history than all those who started the SUV boom in Europe&#x27;s cities. While Porsche was made a bit fun of at the time, today&#x27;s Porsches feel like an anachronistic thing that nobody desires but super rich and wannabes.",
      "time": 1648886555,
      "type": "comment"
    }
  ],
  "wlesieutre": [
    {
      "by": "wlesieutre",
      "id": 30880767,
      "parent": 30880662,
      "text": "Not in the US I don&#x27;t think. Even manufacturers that have been generally anti-touchscreen (read: mazda) went and stuffed in touchscreen HVAC controls because &quot;people expect that in electric cars&quot; or something.",
      "time": 1648833821,
      "type": "comment"
    }
  ],
  "digisign": [
    {
      "by": "digisign",
      "id": 30882209,
      "parent": 30880662,
      "text": "The problem isn&#x27;t only the dashboard, it is the pervasive surveillance.  This car is better than most but I&#x27;ve read here before that it still had some flaws.  Can&#x27;t find the post at the moment however.",
      "time": 1648840726,
      "type": "comment"
    }
  ],
  "hollander": [
    {
      "by": "hollander",
      "id": 30881533,
      "parent": 30880662,
      "text": "That&#x27;s a nice car. The range is a bit limited, but I could see myself buying it. Thanks for this info!",
      "time": 1648837141,
      "type": "comment"
    }
  ],
  "owly": [
    {
      "by": "owly",
      "id": 30882502,
      "parent": 30880662,
      "text": "Nice. I’d buy one immediately if they were available in the US.",
      "time": 1648842382,
      "type": "comment"
    }
  ],
  "__david__": [
    {
      "by": "__david__",
      "id": 30880696,
      "parent": 30880446,
      "text": "&quot;Note 7 situation&quot;—I don&#x27;t understand this reference, can you explain?",
      "time": 1648833501,
      "type": "comment"
    }
  ],
  "aetherspawn": [
    {
      "by": "aetherspawn",
      "id": 30884311,
      "parent": 30880446,
      "text": "Inverter not included .. useless",
      "time": 1648855236,
      "type": "comment"
    }
  ],
  "hnov": [
    {
      "by": "hnov",
      "id": 30881730,
      "parent": 30881124,
      "text": "Engines like the VW typ 4 in the 914 are probably not going extinct anytime soon, you can order a ready to go longblock fairly easily [0]. For larger cars, a GM gen IV V8 can be had with CA-compliant emissions out of any parts catalog [1].<p>[0] <a href=\"https:&#x2F;&#x2F;scatvw.com&#x2F;product&#x2F;2-0-liter-long-block-24-875-779&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;scatvw.com&#x2F;product&#x2F;2-0-liter-long-block-24-875-779&#x2F;</a><p>[1] <a href=\"https:&#x2F;&#x2F;www.jegs.com&#x2F;i&#x2F;Chevrolet-Performance&#x2F;809&#x2F;19421057&#x2F;10002&#x2F;-1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jegs.com&#x2F;i&#x2F;Chevrolet-Performance&#x2F;809&#x2F;19421057&#x2F;10...</a>",
      "time": 1648838082,
      "type": "comment"
    }
  ],
  "fragmede": [
    {
      "by": "fragmede",
      "id": 30882001,
      "parent": 30881774,
      "text": "Some cars house the screen inside rear view mirror (notably some Subarus), as there is no specific requirement on screen size.",
      "time": 1648839513,
      "type": "comment"
    },
    {
      "by": "fragmede",
      "id": 30883832,
      "parent": 30879609,
      "text": "They make automatic semi trucks these days, so depending on your POV, that&#x27;s either closer or futher from the platonic ideal for transmission layout.",
      "time": 1648851011,
      "type": "comment"
    }
  ],
  "inyorgroove": [
    {
      "by": "inyorgroove",
      "id": 30886089,
      "parent": 30880700,
      "text": "My car has this, but with the sunset for 3G this year I am pretty sure the the data can&#x27;t make it home anymore.",
      "time": 1648878274,
      "type": "comment"
    }
  ],
  "ungamedplayer": [
    {
      "by": "ungamedplayer",
      "id": 30885978,
      "parent": 30880700,
      "text": "Some markets don&#x27;t have this. You can&#x27;t get remote start in some Toyotas etc.<p>Is this just a usa thing?",
      "time": 1648876179,
      "type": "comment"
    }
  ],
  "dreamcompiler": [
    {
      "by": "dreamcompiler",
      "id": 30885640,
      "parent": 30880700,
      "text": "First you have to <i>find</i> the antenna, and there might be more than one.",
      "time": 1648870370,
      "type": "comment"
    }
  ],
  "mikepavone": [
    {
      "by": "mikepavone",
      "id": 30883688,
      "parent": 30882335,
      "text": "I don&#x27;t know about that. More powerful engine, 4 wheel disc brakes (rather than 2 disc, 2 drum setup on a base 924) and the switch to electronic fuel injection instead of K-Jetronic all seem like decent upgrades to me. I had an &#x27;83 944 as my daily driver for a couple of years and for a poorly maintained 25 year old sports car it wasn&#x27;t so bad.<p>The combination of an interference engine and a super-long manually tensioned timing belt was rather unfortunate though. I never had an issue with my belt, but adjusting the tension was very stressful. Especially since I was too cheap to buy the proper expensive tool and was using one of the crappy &quot;cricket&quot; ones.",
      "time": 1648849811,
      "type": "comment"
    }
  ],
  "psd1": [
    {
      "by": "psd1",
      "id": 30886993,
      "parent": 30883243,
      "text": "Known issue with my car with D-Jetronic, too",
      "time": 1648892732,
      "type": "comment"
    }
  ],
  "S_A_P": [
    {
      "by": "S_A_P",
      "id": 30882929,
      "parent": 30881616,
      "text": "I agree. I imagine a lot of this is hyperbole rooted in truth. As I have gotten older and had more of an interest in doing my own wrenching I realize half the battle is having the right tools for the job. In most cases that means a good way to lift your vehicle (would love a real lift in my garage) and the appropriate tools to remove or reinstall various items in the car. Having this can mean the difference between a nightmare or relatively easy job. Of course all bets are off if you live where they salt roads in the winter.<p>Edit. Also not being afraid to remove any and all panels required to access something also helps tremendously. So If you own an Audi be prepared to remove the front clip of the car. Google Audi service position for the hairy details.",
      "time": 1648844737,
      "type": "comment"
    }
  ],
  "hyperdimension": [
    {
      "by": "hyperdimension",
      "id": 30882331,
      "parent": 30881122,
      "text": "He might have been the first to convert a Datsun to electric!",
      "time": 1648841489,
      "type": "comment"
    }
  ],
  "abstrakraft": [
    {
      "by": "abstrakraft",
      "id": 30879886,
      "parent": 30879648,
      "text": "This sounds like most of the aside conversations between author and reader in Douglas Adams&#x27; writing.",
      "time": 1648830035,
      "type": "comment"
    }
  ],
  "mjhagen": [
    {
      "by": "mjhagen",
      "id": 30886846,
      "parent": 30881925,
      "text": "Well, with the battery breakthrough of 2034 old Tesla&#x27;s will run on two double-A&#x27;s for 1000 miles.",
      "time": 1648890140,
      "type": "comment"
    }
  ],
  "mturmon": [
    {
      "by": "mturmon",
      "id": 30879496,
      "parent": 30879151,
      "text": "Yes. And the consequences of the pre-1976 smog exemption are all too clear to anyone driving behind an older car on the freeway.<p>There&#x27;s no snow where I live, so these beautiful old heaps can stay on the road far longer than is healthy.",
      "time": 1648828332,
      "type": "comment"
    }
  ],
  "iamtheworstdev": [
    {
      "by": "iamtheworstdev",
      "id": 30879302,
      "parent": 30879078,
      "text": "and some only do it for certain counties (Virginia)",
      "time": 1648827516,
      "type": "comment"
    }
  ],
  "londons_explore": [
    {
      "by": "londons_explore",
      "id": 30879512,
      "parent": 30879078,
      "text": "I imagine this means cars with bad emissions end up living in states with no tests...",
      "time": 1648828384,
      "type": "comment"
    },
    {
      "by": "londons_explore",
      "id": 30880240,
      "parent": 30879839,
      "text": "But there has to be a pretty lucrative trade in buying &#x27;scrap&#x27; (emissions failing, $50 for-the-steel) cars in some states, and shipping them over to non-testing states where they can be sold as &#x27;kinda old but totally usable for a few more years, $3000&#x27;.",
      "time": 1648831356,
      "type": "comment"
    }
  ],
  "mavhc": [
    {
      "by": "mavhc",
      "id": 30883545,
      "parent": 30882209,
      "text": "Find the radio, remove the aerial&#x2F;sim card, done.",
      "time": 1648848901,
      "type": "comment"
    }
  ],
  "colanderman": [
    {
      "by": "colanderman",
      "id": 30880742,
      "parent": 30880696,
      "text": "Lithium-ion battery fire: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Samsung_Galaxy_Note_7#Battery_faults\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Samsung_Galaxy_Note_7#Battery_...</a>",
      "time": 1648833712,
      "type": "comment"
    }
  ],
  "galangalalgol": [
    {
      "by": "galangalalgol",
      "id": 30881733,
      "parent": 30880794,
      "text": "Do any of those BMS do cooling?  The parking lot at work hits 115F regularly and that is bad for batteries. I&#x27;d love a conversion, but I worry I&#x27;d get nissan leaf battery life vs tesla s battery life. I&#x27;m thinking something like an old mazda bongo import. For that matter, do any of the kits power the ac compressor?",
      "time": 1648838096,
      "type": "comment"
    }
  ],
  "ryandrake": [
    {
      "by": "ryandrake",
      "id": 30884026,
      "parent": 30883583,
      "text": "I had to sell my beloved &#x27;86 951 to an out-of-stater due to California emissions madness[1], and miss it every day. I don&#x27;t, however, miss the hours a month spent underneath it keeping it driving. Everything except the turbo was aftermarket by the time I was done with it. The mid-80s were this weird point in time where cars were still wrench-able, but manufacturers started adding electronic gizmos, not knowing how to make those gizmos reliable. It&#x27;s like they were still figuring out how to make everything from engine ECUs to power windows, and trying ideas out on production cars.<p>(It was also my first experience with an interference engine, and the terror of having your timing belt break.)<p>1: Car blew clean as a whistle, even to clean air standards that never existed in 1986, but since the intake and exhaust had all sorts of parts not officially stamped with the CA bureaucracy seal of approval, it had to go :(",
      "time": 1648852656,
      "type": "comment"
    }
  ],
  "ethbr0": [
    {
      "by": "ethbr0",
      "id": 30883278,
      "parent": 30882929,
      "text": "And having a second, drivable car. ;)<p>But I think hobbyist vintage wrenching shares a lot with software feature design: you <i>could</i> do anything, but the real objective is to maximize fun-per-time-spent. Otherwise, you&#x27;re working another full time job as a professional mechanic for your cars.<p>And besides, there&#x27;s something elegant about getting a rat rod to work. :-)",
      "time": 1648846979,
      "type": "comment"
    }
  ],
  "s5300": [
    {
      "by": "s5300",
      "id": 30886141,
      "parent": 30885353,
      "text": "Unless I’m misreading what you’re after, batteryhookup.com<p>I and acquaintances in my hobby have dealt with them a lot, very great site.",
      "time": 1648879113,
      "type": "comment"
    }
  ]
}
